manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/chat/infra/meshtastic/meshtastic_radio_adapter.cpp
#include "platform/nrf52/arduino_common/chat/infra/meshtastic/meshtastic_radio_adapter.h"

#include "chat/domain/contact_types.h"
#include "chat/infra/meshtastic/mt_codec_pb.h"
#include "chat/infra/meshtastic/mt_node_payload.h"
#include "chat/infra/meshtastic/mt_packet_wire.h"
#include "chat/infra/meshtastic/mt_pki_crypto.h"
#include "chat/infra/meshtastic/mt_protocol_helpers.h"
#include "chat/infra/meshtastic/mt_radio_config.h"
#include "chat/infra/meshtastic/mt_region.h"
#include "chat/runtime/meshtastic_position_core.h"
#include "chat/runtime/meshtastic_protocol_policy.h"
#include "chat/runtime/meshtastic_self_announcement_core.h"
#include "chat/runtime/self_identity_policy.h"
#include "meshtastic/mqtt.pb.h"
#include "platform/nrf52/arduino_common/chat/infra/radio_packet_io.h"
#include "platform/nrf52/arduino_common/device_identity.h"
#include "platform/nrf52/arduino_common/mesh/nrf52_settings_mesh_identity_store.h"
#include "platform/nrf52/arduino_common/sys/event_bus.h"
#include "platform/ui/gps_runtime.h"
#include "platform/ui/settings_store.h"
#include "sys/clock.h"

#include <Arduino.h>
#include <Curve25519.h>
#include <RNG.h>

#include <algorithm>
#include <array>
#include <cmath>
#include <cstdarg>
#include <cstring>
#include <ctime>
#include <string>
#include <type_traits>
#include <vector>

namespace platform::nrf52::arduino_common::chat::meshtastic
{
namespace
{
constexpr uint32_t kPacketHistoryTimeoutMs = 10UL * 60UL * 1000UL;
constexpr uint8_t kDefaultNextHopRetries = 2;
constexpr uint8_t kDefaultAckRetries = 3;
constexpr uint32_t kRetransmitIntervalMs = 1500;
constexpr uint32_t kImplicitAckTimeoutMs = 15000;
constexpr uint32_t kNodeInfoIntervalMs = 3UL * 60UL * 60UL * 1000UL;
constexpr uint32_t kKeyVerificationTimeoutMs = 60000UL;
constexpr uint32_t kPkiNodeSaveDebounceMs = 2000UL;
constexpr ::chat::NodeId kBroadcastNode = 0xFFFFFFFFUL;
constexpr uint8_t kDefaultPskIndex = 1;
constexpr uint8_t kBitfieldWantResponseMask = 0x02U;

using ::chat::meshtastic::allowPkiForPortnum;
using ::chat::meshtastic::computeKeyVerificationHashes;
using ::chat::meshtastic::expandShortPsk;
using ::chat::meshtastic::fillDecodedPacketCommon;
using ::chat::meshtastic::hashSharedKey;
using ::chat::meshtastic::initPkiNonce;
using ::chat::meshtastic::isZeroKey;
using ::chat::meshtastic::keyVerificationStage;
using ::chat::meshtastic::makeEncryptedPacketFromWire;
using ::chat::meshtastic::readPbString;
using ::chat::meshtastic::shouldSetAirWantAck;
using ::chat::meshtastic::toHex;

void logMeshtasticRx(const char* format, ...);
uint32_t nowSeconds();

bool shouldRequireDirectPki(uint8_t encrypt_mode, ::chat::NodeId dest_node, uint32_t portnum)
{
    return encrypt_mode != 0 &&
           dest_node != kBroadcastNode &&
           allowPkiForPortnum(portnum);
}

::chat::delivery::SendFailureKind failureKindFromRoutingError(
    meshtastic_Routing_Error reason)
{
    switch (reason)
    {
    case meshtastic_Routing_Error_NONE:
        return ::chat::delivery::SendFailureKind::None;
    case meshtastic_Routing_Error_TIMEOUT:
    case meshtastic_Routing_Error_MAX_RETRANSMIT:
    case meshtastic_Routing_Error_NO_RESPONSE:
    case meshtastic_Routing_Error_NO_ROUTE:
        return ::chat::delivery::SendFailureKind::AckTimeout;
    case meshtastic_Routing_Error_NO_INTERFACE:
    case meshtastic_Routing_Error_DUTY_CYCLE_LIMIT:
    case meshtastic_Routing_Error_RATE_LIMIT_EXCEEDED:
        return ::chat::delivery::SendFailureKind::RadioSendFailed;
    case meshtastic_Routing_Error_NO_CHANNEL:
        return ::chat::delivery::SendFailureKind::ChannelKeyMissing;
    case meshtastic_Routing_Error_PKI_UNKNOWN_PUBKEY:
    case meshtastic_Routing_Error_PKI_FAILED:
        return ::chat::delivery::SendFailureKind::PeerKeyMissing;
    case meshtastic_Routing_Error_GOT_NAK:
    case meshtastic_Routing_Error_BAD_REQUEST:
    case meshtastic_Routing_Error_NOT_AUTHORIZED:
    case meshtastic_Routing_Error_ADMIN_BAD_SESSION_KEY:
    case meshtastic_Routing_Error_ADMIN_PUBLIC_KEY_UNAUTHORIZED:
    case meshtastic_Routing_Error_TOO_LARGE:
        return ::chat::delivery::SendFailureKind::Rejected;
    }
    return ::chat::delivery::SendFailureKind::Unknown;
}

void logMeshtasticRx(const char* format, ...)
{
    char buffer[192] = {};
    va_list args;
    va_start(args, format);
    vsnprintf(buffer, sizeof(buffer), format, args);
    va_end(args);
    Serial.print(buffer);
    Serial2.print(buffer);
}

void toHexString(const uint8_t* data, size_t len, char* out, size_t out_len, size_t max_len = 64)
{
    if (!out || out_len == 0)
    {
        return;
    }

    out[0] = '\0';
    if (!data || len == 0)
    {
        return;
    }

    static constexpr char kHex[] = "0123456789ABCDEF";
    const size_t capped = std::min(len, max_len);
    size_t pos = 0;
    for (size_t i = 0; i < capped && pos + 2 < out_len; ++i)
    {
        const uint8_t b = data[i];
        out[pos++] = kHex[(b >> 4) & 0x0F];
        out[pos++] = kHex[b & 0x0F];
    }
    if (capped < len && pos + 2 < out_len)
    {
        out[pos++] = '.';
        out[pos++] = '.';
    }
    out[pos] = '\0';
}

std::array<uint8_t, 6> readMac()
{
    return device_identity::deriveMacAddressFromDeviceAddress(NRF_FICR->DEVICEADDR[0],
                                                              NRF_FICR->DEVICEADDR[1]);
}

const uint8_t* selectKey(const ::chat::MeshConfig& config,
                         ::chat::ChannelId channel,
                         size_t* out_len)
{
    if (out_len)
    {
        *out_len = 0;
    }

    if (channel == ::chat::ChannelId::SECONDARY)
    {
        const uint8_t key_len = ::chat::normalizeMeshtasticChannelKeyLen(config.secondary_key,
                                                                         sizeof(config.secondary_key),
                                                                         config.secondary_key_len);
        if (key_len > 0)
        {
            if (out_len)
            {
                *out_len = key_len;
            }
            return config.secondary_key;
        }
        return nullptr;
    }

    const uint8_t key_len = ::chat::normalizeMeshtasticChannelKeyLen(config.primary_key,
                                                                     sizeof(config.primary_key),
                                                                     config.primary_key_len);
    if (key_len > 0)
    {
        if (out_len)
        {
            *out_len = key_len;
        }
        return config.primary_key;
    }

    static uint8_t default_primary_psk[16] = {};
    size_t expanded_len = 0;
    expandShortPsk(kDefaultPskIndex, default_primary_psk, &expanded_len);
    if (out_len)
    {
        *out_len = expanded_len;
    }
    return expanded_len > 0 ? default_primary_psk : nullptr;
}

const char* channelNameFor(const ::chat::MeshConfig& config, ::chat::ChannelId channel)
{
    return ::chat::meshtastic::channelName(config, channel);
}

const char* channelDebugLabel(::chat::ChannelId channel)
{
    return (channel == ::chat::ChannelId::SECONDARY) ? "secondary" : "primary";
}

uint8_t channelHashFor(const ::chat::MeshConfig& config, ::chat::ChannelId channel)
{
    size_t key_len = 0;
    const uint8_t* key = selectKey(config, channel, &key_len);
    return ::chat::meshtastic::computeChannelHash(channelNameFor(config, channel), key, key_len);
}

