manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/chat/infra/meshtastic/meshtastic_radio_adapter.cpp
    meshtastic_Data& mqtt_data = scratch.decoded;
    mqtt_data = meshtastic_Data_init_default;
    mqtt_data.portnum = meshtastic_PortNum_TEXT_MESSAGE_APP;
    mqtt_data.want_response = false;
    mqtt_data.dest = dest;
    mqtt_data.source = node_id_;
    mqtt_data.has_bitfield = true;
    mqtt_data.payload.size = std::min(text.size(), sizeof(mqtt_data.payload.bytes));
    if (mqtt_data.payload.size > 0)
    {
        std::memcpy(mqtt_data.payload.bytes, text.data(), mqtt_data.payload.size);
    }

    if (!transmitPreparedWire(wire, wire_size, out_channel, &mqtt_data, track_ack, true, 0, true))
    {
        return false;
    }

    if (out_msg_id)
    {
        *out_msg_id = packet_id;
    }
    return true;
}

bool MeshtasticRadioAdapter::pollIncomingText(::chat::MeshIncomingText* out)
{
    return text_queue_.pop(out);
}

bool MeshtasticRadioAdapter::sendAppData(::chat::ChannelId channel, uint32_t portnum,
                                         const uint8_t* payload, size_t len,
                                         ::chat::NodeId dest, bool want_ack,
                                         ::chat::MessageId packet_id,
                                         bool want_response)
{
    if (!isReady() || (len > 0 && !payload) || !config_.tx_enabled)
    {
        return false;
    }

    ::chat::ChannelId out_channel = channel;
    if (encrypt_mode_ == 0 || encrypt_mode_ == 2)
    {
        out_channel = ::chat::ChannelId::PRIMARY;
    }

    const auto send_policy =
        ::chat::runtime::resolveMeshtasticAppDataSendPolicy(dest, want_ack, want_response);
    const bool effective_want_response = send_policy.effective_want_response;

    auto& scratch = tx_scratch_;
    std::fill(scratch.app_data.begin(), scratch.app_data.end(), 0);
    std::fill(scratch.aux_data.begin(), scratch.aux_data.end(), 0);
    std::fill(scratch.wire.begin(), scratch.wire.end(), 0);
    uint8_t* data_pb = scratch.app_data.data();
    size_t data_pb_size = scratch.app_data.size();
    if (!::chat::meshtastic::encodeAppData(portnum, payload, len, effective_want_response, data_pb, &data_pb_size))
    {
        return false;
    }

    if (packet_id == 0)
    {
        packet_id = next_packet_id_++;
    }
    else if (packet_id >= next_packet_id_)
    {
        next_packet_id_ = packet_id + 1;
        if (next_packet_id_ == 0)
        {
            next_packet_id_ = 1;
        }
    }

    const ::chat::NodeId wire_dest = send_policy.wire_dest;
    size_t key_len = 0;
    const uint8_t* key = selectKey(config_, out_channel, &key_len);
    uint8_t channel_hash = ::chat::meshtastic::computeChannelHash(channelNameFor(config_, out_channel),
                                                                  key,
                                                                  key_len);
    const uint8_t* wire_payload = data_pb;
    size_t wire_payload_len = data_pb_size;
    bool use_pki = false;
    bool wire_want_ack = send_policy.wire_want_ack;
    bool track_ack = send_policy.track_ack;
    if (shouldRequireDirectPki(encrypt_mode_, wire_dest, portnum))
    {
        if (!pki_ready_ || !allowPkiForPortnum(portnum) || !hasPkiKey(wire_dest))
        {
            return false;
        }

        uint8_t* pki_buf = scratch.aux_data.data();
        size_t pki_len = scratch.aux_data.size();
        if (!encryptPkiPayload(wire_dest, packet_id, data_pb, data_pb_size, pki_buf, &pki_len))
        {
            return false;
        }

        wire_payload = pki_buf;
        wire_payload_len = pki_len;
        key = nullptr;
        key_len = 0;
        channel_hash = 0;
        track_ack = true;
        wire_want_ack = true;
        use_pki = true;
    }

    uint8_t* wire = scratch.wire.data();
    size_t wire_size = scratch.wire.size();
    if (!::chat::meshtastic::buildWirePacket(wire_payload,
                                             wire_payload_len,
                                             node_id_,
                                             packet_id,
                                             wire_dest,
                                             channel_hash,
                                             config_.hop_limit,
                                             wire_want_ack,
                                             key,
                                             key_len,
                                             wire,
                                             &wire_size))
    {
        return false;
    }

    meshtastic_Data& mqtt_data = scratch.decoded;
    mqtt_data = meshtastic_Data_init_default;
    mqtt_data.portnum = static_cast<meshtastic_PortNum>(portnum);
    mqtt_data.want_response = effective_want_response;
    mqtt_data.dest = wire_dest;
    mqtt_data.source = node_id_;
    mqtt_data.has_bitfield = true;
    mqtt_data.payload.size = std::min(len, sizeof(mqtt_data.payload.bytes));
    if (mqtt_data.payload.size > 0)
    {
        std::memcpy(mqtt_data.payload.bytes, payload, mqtt_data.payload.size);
    }

    return transmitPreparedWire(wire,
                                wire_size,
                                out_channel,
                                use_pki ? nullptr : &mqtt_data,
                                track_ack,
                                true,
                                0,
                                wire_want_ack);
}

bool MeshtasticRadioAdapter::pollIncomingData(::chat::MeshIncomingData* out)
{
    return data_queue_.pop(out);
}

bool MeshtasticRadioAdapter::requestNodeInfo(::chat::NodeId dest, bool want_response)
{
    return buildAndQueueNodeInfo(dest == 0 ? kBroadcastNode : dest, want_response, ::chat::ChannelId::PRIMARY);
}

bool MeshtasticRadioAdapter::startKeyVerification(::chat::NodeId node_id)
{
    updateKeyVerificationState();
    if (kv_state_ != KeyVerificationState::Idle)
    {
        return false;
    }
    if (!pki_ready_ || !findPkiNodeKey(node_id))
    {
        return false;
    }

    kv_remote_node_ = node_id;
    kv_nonce_ = static_cast<uint64_t>(random());
    kv_nonce_ms_ = millis();
    kv_security_number_ = 0;
    kv_hash1_.fill(0);
    kv_hash2_.fill(0);

    meshtastic_KeyVerification init = meshtastic_KeyVerification_init_zero;
    init.nonce = kv_nonce_;
    if (!sendKeyVerificationPacket(kv_remote_node_, init, true))
    {
        resetKeyVerificationState();
        return false;
    }

    kv_state_ = KeyVerificationState::SenderInitiated;
    return true;
}

bool MeshtasticRadioAdapter::submitKeyVerificationNumber(::chat::NodeId node_id, uint64_t nonce, uint32_t number)
{
    return processKeyVerificationNumber(node_id, nonce, number);
}

bool MeshtasticRadioAdapter::isPkiReady() const
{
    return pki_ready_;
}

bool MeshtasticRadioAdapter::hasPkiKey(::chat::NodeId dest) const
{
    return findPkiNodeKey(dest) != nullptr;
}

