manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/chat/infra/meshtastic/meshtastic_radio_adapter.cpp
void MeshtasticRadioAdapter::applyConfig(const ::chat::MeshConfig& config)
{
    config_ = config;
}

void MeshtasticRadioAdapter::setUserInfo(const char* long_name, const char* short_name)
{
    long_name_ = long_name ? long_name : "";
    short_name_ = short_name ? short_name : "";
}

void MeshtasticRadioAdapter::setNetworkLimits(bool duty_cycle_enabled, uint8_t util_percent)
{
    (void)duty_cycle_enabled;
    (void)util_percent;
}

void MeshtasticRadioAdapter::setPrivacyConfig(uint8_t encrypt_mode)
{
    encrypt_mode_ = encrypt_mode;
    if (!pki_ready_)
    {
        pki_ready_ = initPkiKeys();
        loadPkiNodeKeys();
    }
}

bool MeshtasticRadioAdapter::isReady() const
{
    return ::platform::nrf52::arduino_common::chat::infra::radioPacketIo() != nullptr;
}

::chat::NodeId MeshtasticRadioAdapter::getNodeId() const
{
    return node_id_;
}

void MeshtasticRadioAdapter::setMqttProxySettings(const MqttProxySettings& settings)
{
    const bool changed = mqtt_proxy_settings_.enabled != settings.enabled ||
                         mqtt_proxy_settings_.proxy_to_client_enabled != settings.proxy_to_client_enabled ||
                         mqtt_proxy_settings_.encryption_enabled != settings.encryption_enabled ||
                         mqtt_proxy_settings_.primary_uplink_enabled != settings.primary_uplink_enabled ||
                         mqtt_proxy_settings_.primary_downlink_enabled != settings.primary_downlink_enabled ||
                         mqtt_proxy_settings_.secondary_uplink_enabled != settings.secondary_uplink_enabled ||
                         mqtt_proxy_settings_.secondary_downlink_enabled != settings.secondary_downlink_enabled ||
                         mqtt_proxy_settings_.root != settings.root ||
                         mqtt_proxy_settings_.primary_channel_id != settings.primary_channel_id ||
                         mqtt_proxy_settings_.secondary_channel_id != settings.secondary_channel_id;
    mqtt_proxy_settings_ = settings;
    if (changed)
    {
        logMeshtasticRx("[nrf52][mt][mqtt] settings enabled=%u proxy=%u enc=%u root=%s "
                        "primary='%s' up=%u down=%u secondary='%s' up=%u down=%u\n",
                        mqtt_proxy_settings_.enabled ? 1U : 0U,
                        mqtt_proxy_settings_.proxy_to_client_enabled ? 1U : 0U,
                        mqtt_proxy_settings_.encryption_enabled ? 1U : 0U,
                        mqtt_proxy_settings_.root.c_str(),
                        mqtt_proxy_settings_.primary_channel_id.c_str(),
                        mqtt_proxy_settings_.primary_uplink_enabled ? 1U : 0U,
                        mqtt_proxy_settings_.primary_downlink_enabled ? 1U : 0U,
                        mqtt_proxy_settings_.secondary_channel_id.c_str(),
                        mqtt_proxy_settings_.secondary_uplink_enabled ? 1U : 0U,
                        mqtt_proxy_settings_.secondary_downlink_enabled ? 1U : 0U);
    }
}

bool MeshtasticRadioAdapter::pollMqttProxyMessage(meshtastic_MqttClientProxyMessage* out)
{
    return mqtt_proxy_queue_.popOldest(out);
}

bool MeshtasticRadioAdapter::hasMqttProxyMessage() const
{
    return !mqtt_proxy_queue_.empty();
}

bool MeshtasticRadioAdapter::handleMqttProxyMessage(const meshtastic_MqttClientProxyMessage& msg)
{
    const bool is_data = msg.which_payload_variant == meshtastic_MqttClientProxyMessage_data_tag;
    const size_t data_size = is_data ? static_cast<size_t>(msg.payload_variant.data.size) : 0U;
    const auto inbound_reason = ::chat::meshtastic::validateMqttProxyInbound(
        mqtt_proxy_settings_, is_data, data_size > 0);
    if (inbound_reason != ::chat::meshtastic::MqttProxyRejectReason::None)
    {
        logMeshtasticRx("[nrf52][mt][mqtt] proxy reject reason=%s variant=%u len=%u enabled=%u proxy=%u\n",
                        ::chat::meshtastic::mqttProxyRejectReasonName(inbound_reason),
                        static_cast<unsigned>(msg.which_payload_variant),
                        static_cast<unsigned>(data_size),
                        mqtt_proxy_settings_.enabled ? 1U : 0U,
                        mqtt_proxy_settings_.proxy_to_client_enabled ? 1U : 0U);
        return false;
    }

    const auto* data_field = &msg.payload_variant.data;
    auto& scratch = mqtt_downlink_scratch_;
    std::memset(&scratch.packet, 0, sizeof(scratch.packet));
    std::memset(scratch.channel_id, 0, sizeof(scratch.channel_id));
    std::memset(scratch.gateway_id, 0, sizeof(scratch.gateway_id));
    if (!decodeMqttServiceEnvelope(data_field->bytes, data_field->size,
                                   &scratch.packet,
                                   scratch.channel_id, sizeof(scratch.channel_id),
                                   scratch.gateway_id, sizeof(scratch.gateway_id)))
    {
        logMeshtasticRx("[nrf52][mt][mqtt] proxy reject reason=%s topic='%s' len=%u\n",
                        ::chat::meshtastic::mqttProxyRejectReasonName(
                            ::chat::meshtastic::MqttProxyRejectReason::DecodeFailed),
                        msg.topic,
                        static_cast<unsigned>(data_field->size));
        return false;
    }

    return enqueueMqttEnvelope(scratch.packet, scratch.channel_id, scratch.gateway_id);
}

bool MeshtasticRadioAdapter::pollIncomingRawPacket(uint8_t* out_data, size_t& out_len, size_t max_len)
{
    if (!has_pending_raw_packet_ || !out_data || max_len == 0)
    {
        out_len = 0;
        return false;
    }

    const size_t copy_len = (last_raw_packet_len_ < max_len) ? last_raw_packet_len_ : max_len;
    std::memcpy(out_data, last_raw_packet_, copy_len);
    out_len = copy_len;
    has_pending_raw_packet_ = false;
    return true;
}

void MeshtasticRadioAdapter::handleRawPacket(const uint8_t* data, size_t size)
{
    if (!data || size == 0)
    {
        return;
    }

    if (size <= sizeof(last_raw_packet_))
    {
        std::memcpy(last_raw_packet_, data, size);
        last_raw_packet_len_ = size;
        has_pending_raw_packet_ = true;
    }

    // Keep large protobuf scratch buffers off the task stack. This path can nest
    // MQTT proxy packaging and BLE forwarding on nRF52.
    auto& rx = rx_scratch_;
    std::memset(&rx.header, 0, sizeof(rx.header));
    std::fill(rx.payload.begin(), rx.payload.end(), 0);
    std::fill(rx.plain.begin(), rx.plain.end(), 0);
    std::memset(&rx.decoded, 0, sizeof(rx.decoded));

    auto& header = rx.header;
    uint8_t* payload = rx.payload.data();
    size_t payload_size = rx.payload.size();
    if (!::chat::meshtastic::parseWirePacket(data, size, &header, payload, &payload_size))
    {
        logMeshtasticRx("[gat562][mt] parse fail len=%u\n", static_cast<unsigned>(size));
        return;
    }

    HistoryResult history{};
    if (header.from != node_id_)
    {
        history = updatePacketHistory(header, true);
        if (history.seen_recently && !history.was_upgraded)
        {
            logMeshtasticRx("[gat562][mt] dedup from=%08lX id=%lu relay=%u ch=%u\n",
                            static_cast<unsigned long>(header.from),
                            static_cast<unsigned long>(header.id),
                            static_cast<unsigned>(header.relay_node),
                            static_cast<unsigned>(header.channel));
            return;
        }
    }

    uint8_t* plain = rx.plain.data();
    size_t plain_len = rx.plain.size();
    ::chat::ChannelId channel = ::chat::ChannelId::PRIMARY;
    size_t key_len = 0;
    const uint8_t* key = selectKeyByHash(config_, header.channel, &key_len, &channel);
    const uint8_t primary_hash = channelHashFor(config_, ::chat::ChannelId::PRIMARY);
    const uint8_t secondary_hash = channelHashFor(config_, ::chat::ChannelId::SECONDARY);
    const bool want_ack_flag = (header.flags & ::chat::meshtastic::PACKET_FLAGS_WANT_ACK_MASK) != 0;

    auto& decoded = rx.decoded;
    bool decoded_ok = false;

    if (header.channel == 0)
    {
        (void)getNodeLastChannel(header.from, &channel);

        if (header.to != node_id_ || header.to == kBroadcastNode || payload_size <= 12)
        {
            return;
        }

        if (!pki_ready_)
        {
            (void)primary_hash;
            (void)executePkiResync(::chat::runtime::MeshtasticPkiResyncCause::LocalPkiNotReady,
                                   header.from,
                                   header.id,
                                   ::chat::ChannelId::PRIMARY);
            return;
        }

        if (!decryptPkiPayload(header.from, header.id, payload, payload_size, plain, &plain_len))
        {
            return;
        }
    }
    else if (!key)
    {
        if (!resolvePacketWithKnownKeys(config_,
                                        header,
                                        payload,
                                        payload_size,
                                        false,
                                        ::chat::ChannelId::PRIMARY,
                                        &channel,
                                        &key,
                                        &key_len,
                                        plain,
                                        &plain_len,
                                        &decoded))
        {
            logMeshtasticRx("[gat562][mt] unknown channel from=%08lX to=%08lX id=%lu ch=%u local[p=%u s=%u]\n",
                            static_cast<unsigned long>(header.from),
                            static_cast<unsigned long>(header.to),
                            static_cast<unsigned long>(header.id),
                            static_cast<unsigned>(header.channel),
                            static_cast<unsigned>(primary_hash),
                            static_cast<unsigned>(secondary_hash));
            return;
        }

        decoded_ok = true;
        logMeshtasticRx("[gat562][mt] channel fallback from=%08lX to=%08lX id=%lu rx_ch=%u local[p=%u s=%u] via=%s\n",
                        static_cast<unsigned long>(header.from),
                        static_cast<unsigned long>(header.to),
                        static_cast<unsigned long>(header.id),
                        static_cast<unsigned>(header.channel),
                        static_cast<unsigned>(primary_hash),
                        static_cast<unsigned>(secondary_hash),
                        channelDebugLabel(channel));
    }
    else if (!::chat::meshtastic::decryptPayload(header, payload, payload_size,
                                                 key, key_len, plain, &plain_len))
    {
        logMeshtasticRx("[gat562][mt] decrypt fail from=%08lX to=%08lX id=%lu ch=%u key=%u ack=%u\n",
                        static_cast<unsigned long>(header.from),
                        static_cast<unsigned long>(header.to),
                        static_cast<unsigned long>(header.id),
                        static_cast<unsigned>(header.channel),
                        static_cast<unsigned>(key_len),
                        static_cast<unsigned>(want_ack_flag ? 1U : 0U));

        if (header.to == node_id_ && want_ack_flag)
        {
            if (header.channel == 0)
            {
                (void)executePkiResync(::chat::runtime::MeshtasticPkiResyncCause::PeerKeyMissing,
                                       header.from,
                                       header.id,
                                       ::chat::ChannelId::PRIMARY);
            }
            else if (header.channel != primary_hash && header.channel != secondary_hash)
            {
                (void)executePkiResync(::chat::runtime::MeshtasticPkiResyncCause::LocalNoChannel,
                                       header.from,
                                       header.id,
                                       ::chat::ChannelId::PRIMARY);
            }
        }
        return;
    }

