manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/chat/infra/meshtastic/meshtastic_radio_adapter.cpp
    ::chat::MeshIncomingData app_data{};
    if (decoded_ok &&
        decoded.portnum != meshtastic_PortNum_TRACEROUTE_APP &&
        decoded.portnum != meshtastic_PortNum_TEXT_MESSAGE_APP &&
        decoded.portnum != meshtastic_PortNum_TEXT_MESSAGE_COMPRESSED_APP)
    {
        app_data.portnum = static_cast<uint32_t>(decoded.portnum);
        app_data.from = header.from;
        app_data.to = header.to;
        app_data.packet_id = header.id;
        app_data.request_id = decoded.request_id;
        app_data.channel = channel;
        app_data.channel_hash = header.channel;
        app_data.hop_limit = hop_limit;
        app_data.want_response = want_response;
        app_data.rx_meta = rx_meta;

        logMeshtasticRx("[gat562][mt] app queued from=%08lX to=%08lX id=%lu port=%u len=%u\n",
                        static_cast<unsigned long>(app_data.from),
                        static_cast<unsigned long>(app_data.to),
                        static_cast<unsigned long>(app_data.packet_id),
                        static_cast<unsigned>(app_data.portnum),
                        static_cast<unsigned>(decoded.payload.size));

        ::chat::infra::IncomingQueuePushReport report{};
        if (data_queue_.push(app_data,
                             decoded.payload.bytes,
                             decoded.payload.size,
                             ::chat::infra::IncomingQueuePriority::P1User,
                             &report))
        {
            if (report.dropped_existing)
            {
                logMeshtasticRx("[gat562][mt] app queue evicted prio=%u depth=%u\n",
                                static_cast<unsigned>(report.dropped_priority),
                                static_cast<unsigned>(data_queue_.size()));
            }
        }
        else
        {
            logMeshtasticRx("[gat562][mt] app queue drop new port=%u len=%u depth=%u\n",
                            static_cast<unsigned>(app_data.portnum),
                            static_cast<unsigned>(decoded.payload.size),
                            static_cast<unsigned>(data_queue_.size()));
        }
    }
}

void MeshtasticRadioAdapter::setLastRxStats(float rssi, float snr)
{
    last_rx_rssi_ = rssi;
    last_rx_snr_ = snr;
}

void MeshtasticRadioAdapter::processSendQueue()
{
    processPendingMqttDownlinks();

    const uint32_t now_ms = millis();
    maybeBroadcastNodeInfo(now_ms);
    for (std::size_t index = 0; index < pending_retransmits_.capacity();)
    {
        PendingRetransmitSlot* slot = pending_retransmits_.slotAt(index);
        if (!slot || !slot->used)
        {
            ++index;
            continue;
        }

        auto& pending = slot->meta;
        if (pending.next_tx_ms > now_ms)
        {
            ++index;
            continue;
        }

        auto* header = reinterpret_cast<::chat::meshtastic::PacketHeaderWire*>(slot->wire.data());
        if (pending.retries_left == 0)
        {
            if (pending.observe_only)
            {
                logMeshtasticRx("[gat562][mt] observe timeout id=%08lX dest=%08lX ch=%u local=%u want_ack=%u\n",
                                static_cast<unsigned long>(pending.packet_id),
                                static_cast<unsigned long>(pending.dest),
                                static_cast<unsigned>(pending.channel),
                                pending.local_origin ? 1U : 0U,
                                pending.want_ack ? 1U : 0U);
            }
            if (pending.local_origin && pending.want_ack)
            {
                emitRoutingResult(pending.packet_id,
                                  meshtastic_Routing_Error_MAX_RETRANSMIT,
                                  node_id_,
                                  pending.dest,
                                  pending.channel,
                                  pending.channel_hash,
                                  nullptr);
            }
            if (contact_service_ && pending.dest != 0 &&
                pending.dest != kBroadcastNode)
            {
                contact_service_->setNextHop(pending.dest, 0);
            }
            pending_retransmits_.eraseAt(index);
            continue;
        }

        if (pending.observe_only)
        {
            ++index;
            continue;
        }

        if (pending.retries_left == 1 && header->next_hop != 0)
        {
            header->next_hop = 0;
            pending.fallback_sent = true;
            if (contact_service_ && pending.dest != 0 &&
                pending.dest != kBroadcastNode)
            {
                contact_service_->setNextHop(pending.dest, 0);
            }
        }

        if (transmitWire(slot->wire.data(), slot->wire_size))
        {
            rememberLocalPacket(*header);
        }
        pending.retries_left--;
        pending.next_tx_ms = now_ms + kRetransmitIntervalMs;
        ++index;
    }
}

void MeshtasticRadioAdapter::flushDeferredPersistence(bool force)
{
    if (!pki_node_keys_dirty_)
    {
        return;
    }

    const uint32_t now_ms = millis();
    if (!force && static_cast<int32_t>(now_ms - pki_node_keys_save_due_ms_) < 0)
    {
        return;
    }

    if (!savePkiKeysToPrefs())
    {
        pki_node_keys_save_due_ms_ = millis() + kPkiNodeSaveDebounceMs;
    }
}

::chat::runtime::EffectiveSelfIdentity MeshtasticRadioAdapter::buildEffectiveIdentity() const
{
    ::chat::runtime::EffectiveSelfIdentity identity{};

    if (identity_provider_)
    {
        ::chat::runtime::SelfIdentityInput input{};
        if (identity_provider_->readSelfIdentityInput(&input))
        {
            if (!long_name_.empty())
            {
                input.configured_long_name = long_name_.c_str();
            }
            if (!short_name_.empty())
            {
                input.configured_short_name = short_name_.c_str();
            }
            (void)::chat::runtime::resolveEffectiveSelfIdentity(input, &identity);
            return identity;
        }
    }

    ::chat::runtime::SelfIdentityInput input{};
    input.node_id = node_id_;
    input.configured_long_name = long_name_.c_str();
    input.configured_short_name = short_name_.c_str();
    input.fallback_long_prefix = "node";
    input.fallback_ble_prefix = "node";
    input.allow_short_hex_fallback = true;
    (void)::chat::runtime::resolveEffectiveSelfIdentity(input, &identity);
    return identity;
}

