manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/chat/infra/meshtastic/meshtastic_radio_adapter.cpp
bool MeshtasticRadioAdapter::transmitWire(const uint8_t* data, size_t size)
{
    auto* io = ::platform::nrf52::arduino_common::chat::infra::radioPacketIo();
    return io && io->transmit(data, size);
}

bool MeshtasticRadioAdapter::transmitPreparedWire(uint8_t* data, size_t size, ::chat::ChannelId channel,
                                                  const meshtastic_Data* decoded, bool track_retransmit,
                                                  bool local_origin, uint8_t retries_override,
                                                  bool observe_broadcast_ack)
{
    if (!data || size < sizeof(::chat::meshtastic::PacketHeaderWire))
    {
        return false;
    }

    auto* header = reinterpret_cast<::chat::meshtastic::PacketHeaderWire*>(data);
    logMeshtasticRx("[gat562][mt] tx from=%08lX to=%08lX id=%lu flags=0x%02X ch=%u next=%u relay=%u len=%u\n",
                    static_cast<unsigned long>(header->from),
                    static_cast<unsigned long>(header->to),
                    static_cast<unsigned long>(header->id),
                    static_cast<unsigned>(header->flags),
                    static_cast<unsigned>(header->channel),
                    static_cast<unsigned>(header->next_hop),
                    static_cast<unsigned>(header->relay_node),
                    static_cast<unsigned>(size));
    auto& wire_hex = tx_scratch_.wire_hex;
    std::fill(wire_hex.begin(), wire_hex.end(), '\0');
    toHexString(data, size, wire_hex.data(), wire_hex.size(), size);
    if (wire_hex[0] != '\0')
    {
        logMeshtasticRx("[gat562][mt] tx hex %s\n", wire_hex.data());
    }
    if (!transmitWire(data, size))
    {
        return false;
    }

    rememberLocalPacket(*header);
    if (decoded)
    {
        queueMqttProxyPublishFromWire(data, size, decoded, channel);
    }

    const bool is_unicast = header->to != kBroadcastNode;
    const bool wants_ack = (header->flags & ::chat::meshtastic::PACKET_FLAGS_WANT_ACK_MASK) != 0;
    if (local_origin && !is_unicast && !observe_broadcast_ack)
    {
        // Broadcast messages do not receive air ACKs, but the phone app still
        // expects a successful routing result to transition the local message
        // from "queued" to "sent".
        emitRoutingResult(header->id,
                          meshtastic_Routing_Error_NONE,
                          header->from,
                          header->to,
                          channel,
                          header->channel,
                          nullptr);
    }
    if (track_retransmit &&
        ((is_unicast && (header->next_hop != 0 || wants_ack)) ||
         (local_origin && !is_unicast && observe_broadcast_ack)))
    {
        queuePendingRetransmit(*header, data, size, channel, local_origin, retries_override, !is_unicast);
    }
    return true;
}

bool MeshtasticRadioAdapter::buildAndQueueNodeInfo(::chat::NodeId dest, bool want_response,
                                                   ::chat::ChannelId channel)
{
    auto mac = readMac();
    if (identity_provider_)
    {
        ::chat::runtime::SelfIdentityInput input{};
        if (identity_provider_->readSelfIdentityInput(&input) && input.mac_addr && input.mac_addr_len >= mac.size())
        {
            std::memcpy(mac.data(), input.mac_addr, mac.size());
        }
    }

    ::chat::runtime::MeshtasticAnnouncementRequest request{};
    request.identity = buildEffectiveIdentity();
    request.mesh_config = config_;
    request.channel = channel;
    request.packet_id = next_packet_id_++;
    request.dest_node = dest;
    request.hop_limit = config_.hop_limit;
    request.want_response = want_response;
    request.mac_addr = mac.data();
    if (pki_ready_)
    {
        request.public_key = pki_public_key_.data();
        request.public_key_len = pki_public_key_.size();
    }

    ::chat::runtime::MeshtasticAnnouncementPacket packet{};
    if (!::chat::runtime::MeshtasticSelfAnnouncementCore::buildNodeInfoPacket(request, &packet))
    {
        return false;
    }
    const bool ok = transmitWire(packet.wire, packet.wire_size);
    if (ok && dest == kBroadcastNode)
    {
        last_nodeinfo_ms_ = millis();
    }
    return ok;
}

bool MeshtasticRadioAdapter::buildAndQueueRoutingPacket(::chat::NodeId dest, uint32_t request_id,
                                                        uint8_t channel_hash, ::chat::ChannelId channel,
                                                        meshtastic_Routing_Error reason,
                                                        const uint8_t* key, size_t key_len,
                                                        uint8_t hop_limit)
{
    meshtastic_Routing routing = meshtastic_Routing_init_default;
    routing.which_variant = meshtastic_Routing_error_reason_tag;
    routing.error_reason = reason;

    uint8_t routing_buf[64] = {};
    pb_ostream_t rstream = pb_ostream_from_buffer(routing_buf, sizeof(routing_buf));
    if (!pb_encode(&rstream, meshtastic_Routing_fields, &routing))
    {
        return false;
    }

    auto& scratch = tx_scratch_;
    std::fill(scratch.app_data.begin(), scratch.app_data.end(), 0);
    std::fill(scratch.aux_data.begin(), scratch.aux_data.end(), 0);
    std::fill(scratch.wire.begin(), scratch.wire.end(), 0);

    meshtastic_Data& data = scratch.decoded;
    data = meshtastic_Data_init_default;
    data.portnum = meshtastic_PortNum_ROUTING_APP;
    data.want_response = false;
    data.dest = dest;
    data.source = node_id_;
    data.request_id = request_id;
    data.has_bitfield = true;
    data.bitfield = 0;
    data.payload.size = static_cast<pb_size_t>(rstream.bytes_written);
    std::memcpy(data.payload.bytes, routing_buf, data.payload.size);

    uint8_t* data_buf = scratch.app_data.data();
    pb_ostream_t dstream = pb_ostream_from_buffer(data_buf, scratch.app_data.size());
    if (!pb_encode(&dstream, meshtastic_Data_fields, &data))
    {
        return false;
    }

    const uint8_t* wire_payload = data_buf;
    size_t wire_payload_len = dstream.bytes_written;
    if (channel_hash == 0)
    {
        uint8_t* payload_buf = scratch.aux_data.data();
        size_t pki_len = scratch.aux_data.size();
        const ::chat::MessageId packet_id = next_packet_id_;
        if (!encryptPkiPayload(dest, packet_id, data_buf, dstream.bytes_written, payload_buf, &pki_len))
        {
            return false;
        }
        wire_payload = payload_buf;
        wire_payload_len = pki_len;
        key = nullptr;
        key_len = 0;
    }

    uint8_t* wire = scratch.wire.data();
    size_t wire_size = scratch.wire.size();
    if (!::chat::meshtastic::buildWirePacket(wire_payload, wire_payload_len,
                                             node_id_, next_packet_id_++,
                                             dest, channel_hash, hop_limit, false,
                                             key, key_len, wire, &wire_size))
    {
        return false;
    }

    return transmitPreparedWire(wire, wire_size, channel, &data, false, true);
}

