manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/chat/infra/meshtastic/meshtastic_radio_adapter.cpp
void MeshtasticRadioAdapter::maybeBroadcastNodeInfo(uint32_t now_ms)
{
    if (!config_.tx_enabled)
    {
        return;
    }
    if (last_nodeinfo_ms_ != 0 && (now_ms - last_nodeinfo_ms_) < kNodeInfoIntervalMs)
    {
        return;
    }
    (void)buildAndQueueNodeInfo(kBroadcastNode, false, ::chat::ChannelId::PRIMARY);
}

void MeshtasticRadioAdapter::maybeBroadcastNodeInfoAfterPeerAnnouncement(::chat::NodeId from_node,
                                                                         uint32_t now_ms,
                                                                         ::chat::ChannelId channel,
                                                                         bool from_mqtt)
{
    const auto policy = ::chat::runtime::resolveMeshtasticNodeInfoReannouncePolicy(
        isReady(),
        config_.tx_enabled,
        from_mqtt,
        from_node,
        node_id_,
        now_ms,
        last_nodeinfo_ms_);
    if (!policy.should_announce)
    {
        if (policy.reason == ::chat::runtime::MeshtasticNodeInfoReannounceReason::Suppressed)
        {
            logMeshtasticRx("[gat562][mt] nodeinfo announce suppressed from=%08lX age=%lu\n",
                            static_cast<unsigned long>(from_node),
                            static_cast<unsigned long>(policy.age_ms));
        }
        return;
    }

    if (buildAndQueueNodeInfo(kBroadcastNode, false, channel))
    {
        logMeshtasticRx("[gat562][mt] nodeinfo announce after peer from=%08lX ch=%u\n",
                        static_cast<unsigned long>(from_node),
                        static_cast<unsigned>(channel));
    }
    else
    {
        logMeshtasticRx("[gat562][mt] nodeinfo announce fail after peer from=%08lX ch=%u\n",
                        static_cast<unsigned long>(from_node),
                        static_cast<unsigned>(channel));
    }
}

bool MeshtasticRadioAdapter::sendRoutingAck(::chat::NodeId dest, uint32_t request_id, uint8_t channel_hash,
                                            ::chat::ChannelId channel, const uint8_t* key, size_t key_len,
                                            uint8_t hop_limit)
{
    return buildAndQueueRoutingPacket(dest, request_id, channel_hash, channel,
                                      meshtastic_Routing_Error_NONE, key, key_len, hop_limit);
}

bool MeshtasticRadioAdapter::sendRoutingError(::chat::NodeId dest, uint32_t request_id, uint8_t channel_hash,
                                              ::chat::ChannelId channel, const uint8_t* key, size_t key_len,
                                              meshtastic_Routing_Error reason, uint8_t hop_limit)
{
    return buildAndQueueRoutingPacket(dest, request_id, channel_hash, channel,
                                      reason, key, key_len, hop_limit);
}

::chat::runtime::RuntimeContext MeshtasticRadioAdapter::buildProtocolRuntimeContext() const
{
    ::chat::runtime::RuntimeContext context{};
    context.protocol = ::chat::MeshProtocol::Meshtastic;
    context.self_node = node_id_;
    context.now_ms = millis();

    const ::chat::runtime::MeshtasticPositionInput position = buildSelfPositionInput();
    context.self_position_valid = position.valid;
    context.self_latitude_deg = position.latitude_deg;
    context.self_longitude_deg = position.longitude_deg;
    context.self_has_altitude = position.has_altitude;
    context.self_altitude_m = position.altitude_m;
    context.self_has_speed = position.has_speed;
    context.self_speed_mps = position.speed_mps;
    context.self_has_course = position.has_course;
    context.self_course_deg = position.course_deg;
    context.self_satellites = position.satellites;
    context.self_position_timestamp_s = position.timestamp_s;
    return context;
}

bool MeshtasticRadioAdapter::sendProtocolPacketEffect(
    const ::chat::runtime::SendPacketEffect& packet)
{
    const uint8_t* payload = packet.payload.empty() ? nullptr : packet.payload.data();
    const size_t payload_len = packet.payload.size();
    if (packet.response_request_id == 0)
    {
        return sendAppData(packet.channel,
                           packet.portnum,
                           payload,
                           payload_len,
                           packet.dest,
                           packet.want_ack,
                           packet.request_id,
                           packet.want_response);
    }

    if (!isReady() || !config_.tx_enabled)
    {
        return false;
    }

    ::chat::ChannelId out_channel = packet.channel;
    if (packet.portnum == meshtastic_PortNum_POSITION_APP &&
        (encrypt_mode_ == 0 || encrypt_mode_ == 2))
    {
        out_channel = ::chat::ChannelId::PRIMARY;
    }

    auto& scratch = tx_scratch_;
    std::fill(scratch.app_data.begin(), scratch.app_data.end(), 0);
    std::fill(scratch.wire.begin(), scratch.wire.end(), 0);

    meshtastic_Data& data = scratch.decoded;
    data = meshtastic_Data_init_default;
    if (payload_len > sizeof(data.payload.bytes))
    {
        return false;
    }
    data.portnum = static_cast<meshtastic_PortNum>(packet.portnum);
    data.want_response = packet.want_response;
    data.dest = packet.dest;
    data.source = node_id_;
    data.request_id = packet.response_request_id;
    data.has_bitfield = true;
    data.bitfield = packet.want_response ? kBitfieldWantResponseMask : 0;
    data.payload.size = static_cast<pb_size_t>(payload_len);
    if (payload_len > 0)
    {
        std::memcpy(data.payload.bytes, payload, payload_len);
    }

    uint8_t* data_buf = scratch.app_data.data();
    pb_ostream_t dstream = pb_ostream_from_buffer(data_buf, scratch.app_data.size());
    if (!pb_encode(&dstream, meshtastic_Data_fields, &data))
    {
        return false;
    }

    size_t key_len = 0;
    const uint8_t* key = selectKey(config_, out_channel, &key_len);
    const uint8_t channel_hash = channelHashFor(config_, out_channel);

    uint8_t* wire = scratch.wire.data();
    size_t wire_size = scratch.wire.size();
    const ::chat::MessageId wire_id =
        packet.request_id != 0 ? packet.request_id : next_packet_id_++;
    if (!::chat::meshtastic::buildWirePacket(data_buf,
                                             dstream.bytes_written,
                                             node_id_,
                                             wire_id,
                                             packet.dest,
                                             channel_hash,
                                             config_.hop_limit,
                                             packet.want_ack,
                                             key,
                                             key_len,
                                             wire,
                                             &wire_size))
    {
        return false;
    }

    return transmitPreparedWire(wire,
                                wire_size,
                                out_channel,
                                &data,
                                packet.want_ack,
                                true);
}

