manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/chat/infra/meshtastic/meshtastic_radio_adapter.cpp
bool MeshtasticRadioAdapter::executeProtocolEffects(const ::chat::runtime::ProtocolEffects& effects)
{
    bool ok = true;
    for (const auto& effect : effects.items)
    {
        ok = executeProtocolEffect(effect) && ok;
    }
    return ok;
}

bool MeshtasticRadioAdapter::executeProtocolEffect(const ::chat::runtime::ProtocolEffect& effect)
{
    bool ok = false;
    ::chat::runtime::visitProtocolEffect(
        effect,
        [this, &ok](const auto& item)
        {
            using Effect = std::decay_t<decltype(item)>;
            if constexpr (std::is_same_v<Effect, ::chat::runtime::SendNodeInfoEffect>)
            {
                ok = buildAndQueueNodeInfo(item.peer, item.want_response, item.channel);
            }
            else if constexpr (std::is_same_v<Effect, ::chat::runtime::SendRoutingErrorEffect>)
            {
                size_t key_len = 0;
                const uint8_t* key = selectKey(config_, item.channel, &key_len);
                const uint8_t channel_hash = channelHashFor(config_, item.channel);
                ok = sendRoutingError(item.peer,
                                      item.request_id,
                                      channel_hash,
                                      item.channel,
                                      key,
                                      key_len,
                                      static_cast<meshtastic_Routing_Error>(item.error_code),
                                      0);
            }
            else if constexpr (std::is_same_v<Effect, ::chat::runtime::ForgetPeerKeyEffect>)
            {
                forgetNodePublicKey(item.peer);
                ok = true;
            }
            else if constexpr (std::is_same_v<Effect, ::chat::runtime::SendPacketEffect>)
            {
                ok = sendProtocolPacketEffect(item);
            }
            else if constexpr (std::is_same_v<Effect, ::chat::runtime::PublishIncomingDataEffect>)
            {
                ::chat::infra::IncomingQueuePushReport report{};
                if (data_queue_.push(item.data,
                                     ::chat::infra::IncomingQueuePriority::P1User,
                                     &report))
                {
                    if (report.dropped_existing)
                    {
                        logMeshtasticRx("[gat562][mt] protocol data queue evicted prio=%u depth=%u\n",
                                        static_cast<unsigned>(report.dropped_priority),
                                        static_cast<unsigned>(data_queue_.size()));
                    }
                    ok = true;
                }
                else
                {
                    logMeshtasticRx("[gat562][mt] protocol data queue drop port=%u len=%u depth=%u\n",
                                    static_cast<unsigned>(item.data.portnum),
                                    static_cast<unsigned>(item.data.payload.size()),
                                    static_cast<unsigned>(data_queue_.size()));
                    ok = false;
                }
            }
        });
    return ok;
}

bool MeshtasticRadioAdapter::executePkiResync(::chat::runtime::MeshtasticPkiResyncCause cause,
                                              ::chat::NodeId peer,
                                              ::chat::MessageId request_id,
                                              ::chat::ChannelId channel)
{
    ::chat::runtime::MeshtasticPkiResyncInput input{};
    input.cause = cause;
    input.peer = peer;
    input.request_id = request_id;
    input.channel = channel;
    protocol_effect_workspace_.primary.clear();
    protocol_runtime_.handlePkiResync(input, protocol_effect_workspace_.primary);
    return executeProtocolEffects(protocol_effect_workspace_.primary);
}

void MeshtasticRadioAdapter::emitRoutingResult(uint32_t request_id, meshtastic_Routing_Error reason,
                                               ::chat::NodeId from, ::chat::NodeId to,
                                               ::chat::ChannelId channel, uint8_t channel_hash,
                                               const ::chat::RxMeta* rx_meta)
{
    if (request_id == 0)
    {
        return;
    }

    const bool own_self_echo = from == node_id_ && to == node_id_;
    const ::chat::MessageStatus status =
        reason != meshtastic_Routing_Error_NONE
            ? ::chat::MessageStatus::Failed
            : (own_self_echo ? ::chat::MessageStatus::Sent
                             : ::chat::MessageStatus::Delivered);
    sys::EventBus::publish(
        new sys::ChatSendResultEvent(request_id,
                                     status,
                                     ::chat::MeshProtocol::Meshtastic,
                                     failureKindFromRoutingError(reason)),
        0);

    meshtastic_Routing routing = meshtastic_Routing_init_default;
    routing.which_variant = meshtastic_Routing_error_reason_tag;
    routing.error_reason = reason;

    uint8_t routing_buf[32] = {};
    pb_ostream_t rstream = pb_ostream_from_buffer(routing_buf, sizeof(routing_buf));
    if (!pb_encode(&rstream, meshtastic_Routing_fields, &routing))
    {
        return;
    }

    ::chat::MeshIncomingData incoming{};
    incoming.portnum = meshtastic_PortNum_ROUTING_APP;
    incoming.from = from;
    incoming.to = to;
    incoming.packet_id = 0;
    incoming.request_id = request_id;
    incoming.channel = channel;
    incoming.channel_hash = channel_hash;
    incoming.hop_limit = rx_meta ? rx_meta->hop_limit : 0;
    if (rx_meta)
    {
        incoming.rx_meta = *rx_meta;
    }
    else
    {
        incoming.rx_meta.rx_timestamp_ms = millis();
        incoming.rx_meta.rx_timestamp_s = nowSeconds();
        incoming.rx_meta.time_source = ::chat::RxTimeSource::DeviceUtc;
        incoming.rx_meta.origin = ::chat::RxOrigin::Mesh;
        incoming.rx_meta.channel_hash = channel_hash;
    }
    ::chat::infra::IncomingQueuePushReport report{};
    if (!data_queue_.push(incoming,
                          routing_buf,
                          rstream.bytes_written,
                          ::chat::infra::IncomingQueuePriority::P0Critical,
                          &report))
    {
        logMeshtasticRx("[gat562][mt] routing queue drop new req=%08lX depth=%u\n",
                        static_cast<unsigned long>(request_id),
                        static_cast<unsigned>(data_queue_.size()));
    }
    else if (report.dropped_existing)
    {
        logMeshtasticRx("[gat562][mt] routing queue evicted prio=%u req=%08lX depth=%u\n",
                        static_cast<unsigned>(report.dropped_priority),
                        static_cast<unsigned long>(request_id),
                        static_cast<unsigned>(data_queue_.size()));
    }
}

uint8_t MeshtasticRadioAdapter::ourRelayId() const
{
    return static_cast<uint8_t>(node_id_ & 0xFFU);
}

