manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/chat/infra/meshtastic/meshtastic_radio_adapter.cpp
uint8_t MeshtasticRadioAdapter::getLearnedNextHop(::chat::NodeId dest, uint8_t relay_node) const
{
    if (!contact_service_ || dest == 0 || dest == kBroadcastNode)
    {
        return 0;
    }

    const uint8_t next_hop = contact_service_->getNextHop(dest);
    if (next_hop == 0 || next_hop == relay_node)
    {
        return 0;
    }
    return next_hop;
}

void MeshtasticRadioAdapter::learnNextHop(::chat::NodeId dest, uint8_t next_hop)
{
    if (!contact_service_ || dest == 0 || dest == kBroadcastNode ||
        next_hop == 0 || next_hop == ourRelayId())
    {
        return;
    }
    (void)contact_service_->setNextHop(dest, next_hop);
}

MeshtasticRadioAdapter::PacketHistoryEntry* MeshtasticRadioAdapter::findHistory(::chat::NodeId sender, ::chat::MessageId packet_id)
{
    return packet_history_.find(sender, packet_id);
}

const MeshtasticRadioAdapter::PacketHistoryEntry* MeshtasticRadioAdapter::findHistory(::chat::NodeId sender, ::chat::MessageId packet_id) const
{
    return packet_history_.find(sender, packet_id);
}

bool MeshtasticRadioAdapter::hasRelayer(const PacketHistoryEntry& entry, uint8_t relayer, bool* sole)
{
    bool found = false;
    bool other_present = false;
    for (uint8_t value : entry.relayed_by)
    {
        if (value == relayer)
        {
            found = true;
        }
        else if (value != 0)
        {
            other_present = true;
        }
    }
    if (sole)
    {
        *sole = found && !other_present;
    }
    return found;
}

MeshtasticRadioAdapter::HistoryResult MeshtasticRadioAdapter::updatePacketHistory(const ::chat::meshtastic::PacketHeaderWire& header,
                                                                                  bool allow_update)
{
    HistoryResult result{};
    if (header.id == 0)
    {
        return result;
    }

    const uint32_t now_ms = millis();
    packet_history_.pruneExpired(now_ms, kPacketHistoryTimeoutMs);

    PacketHistoryEntry* existing = findHistory(header.from, header.id);
    const uint8_t hop_limit = header.flags & ::chat::meshtastic::PACKET_FLAGS_HOP_LIMIT_MASK;
    const uint8_t relay_id = ourRelayId();

    if (existing)
    {
        result.seen_recently = true;
        result.we_were_next_hop = (existing->next_hop == relay_id);
        result.was_upgraded = hop_limit > existing->highest_hop_limit;
        if (existing->next_hop != 0 && existing->next_hop != relay_id &&
            header.next_hop == 0 && header.relay_node != 0 &&
            hasRelayer(*existing, header.relay_node) &&
            !hasRelayer(*existing, relay_id) &&
            !hasRelayer(*existing, existing->next_hop))
        {
            result.was_fallback = true;
        }
    }

    if (!allow_update)
    {
        return result;
    }

    if (!existing)
    {
        existing = packet_history_.allocateDropOldest();
        existing->sender = header.from;
        existing->packet_id = header.id;
    }

    existing->last_rx_ms = now_ms;
    existing->highest_hop_limit = std::max(existing->highest_hop_limit, hop_limit);
    if (existing->next_hop == 0)
    {
        existing->next_hop = header.next_hop;
    }
    if (header.relay_node != 0 && !hasRelayer(*existing, header.relay_node))
    {
        auto slot = std::find(existing->relayed_by.begin(), existing->relayed_by.end(), 0);
        if (slot != existing->relayed_by.end())
        {
            *slot = header.relay_node;
        }
        else
        {
            existing->relayed_by[0] = header.relay_node;
        }
    }
    return result;
}

void MeshtasticRadioAdapter::rememberLocalPacket(const ::chat::meshtastic::PacketHeaderWire& header)
{
    if (header.id == 0)
    {
        return;
    }

    PacketHistoryEntry* entry = findHistory(header.from, header.id);
    if (!entry)
    {
        entry = packet_history_.allocateDropFirst();
        entry->sender = header.from;
        entry->packet_id = header.id;
    }

    entry->last_rx_ms = millis();
    entry->next_hop = header.next_hop;
    entry->highest_hop_limit = header.flags & ::chat::meshtastic::PACKET_FLAGS_HOP_LIMIT_MASK;
    entry->our_tx_hop_limit = entry->highest_hop_limit;
    entry->relayed_by.fill(0);
    if (header.relay_node != 0)
    {
        entry->relayed_by[0] = header.relay_node;
    }
}

bool MeshtasticRadioAdapter::maybeRebroadcast(const ::chat::meshtastic::PacketHeaderWire& header,
                                              const uint8_t* payload, size_t payload_size,
                                              ::chat::ChannelId channel, const meshtastic_Data* decoded)
{
    if (!config_.enable_relay || !payload || payload_size == 0)
    {
        return false;
    }
    if (header.from == node_id_ || header.to == node_id_)
    {
        return false;
    }

    uint8_t hop_limit = header.flags & ::chat::meshtastic::PACKET_FLAGS_HOP_LIMIT_MASK;
    if (hop_limit == 0)
    {
        return false;
    }

    if (header.next_hop != 0 && header.next_hop != ourRelayId())
    {
        return false;
    }

    size_t key_len = 0;
    const uint8_t* key = selectKey(config_, channel, &key_len);
    auto& scratch = tx_scratch_;
    std::fill(scratch.wire.begin(), scratch.wire.end(), 0);
    uint8_t* wire = scratch.wire.data();
    size_t wire_size = scratch.wire.size();
    const bool want_ack = (header.flags & ::chat::meshtastic::PACKET_FLAGS_WANT_ACK_MASK) != 0;
    if (!::chat::meshtastic::buildWirePacket(payload, payload_size,
                                             header.from, header.id, header.to,
                                             header.channel, static_cast<uint8_t>(hop_limit - 1),
                                             want_ack, key, key_len, wire, &wire_size))
    {
        return false;
    }

    auto* out_header = reinterpret_cast<::chat::meshtastic::PacketHeaderWire*>(wire);
    out_header->relay_node = ourRelayId();
    out_header->next_hop = (header.next_hop == ourRelayId()) ? 0 : header.next_hop;
    return transmitPreparedWire(wire, wire_size, channel, decoded, header.next_hop != 0, false, 1);
}

void MeshtasticRadioAdapter::updateNodeLastSeen(::chat::NodeId node_id, uint8_t hops_away, ::chat::ChannelId channel)
{
    if (node_id == 0 || node_id == node_id_ || !contact_service_)
    {
        return;
    }

