manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/chat/infra/meshtastic/meshtastic_radio_adapter.cpp
    ::chat::contacts::NodeUpdate update{};
    update.has_last_seen = true;
    update.last_seen = nowSeconds();
    update.has_snr = !std::isnan(last_rx_snr_);
    update.snr = last_rx_snr_;
    update.has_rssi = !std::isnan(last_rx_rssi_);
    update.rssi = last_rx_rssi_;
    update.has_protocol = true;
    update.protocol = static_cast<uint8_t>(::chat::contacts::NodeProtocolType::Meshtastic);
    update.has_role = false;
    update.role = ::chat::contacts::kNodeRoleUnknown;
    update.has_hops_away = hops_away != 0xFFU;
    update.hops_away = hops_away;
    update.has_hw_model = false;
    update.hw_model = 0;
    update.has_channel = true;
    update.channel = static_cast<uint8_t>(channel);

    contact_service_->applyNodeUpdate(node_id, update);
}

void MeshtasticRadioAdapter::handleRoutingPacket(const ::chat::meshtastic::PacketHeaderWire& header,
                                                 const meshtastic_Data& decoded,
                                                 ::chat::ChannelId channel,
                                                 const uint8_t* key, size_t key_len,
                                                 const ::chat::RxMeta& rx_meta)
{
    (void)key;
    (void)key_len;

    if (decoded.payload.size == 0)
    {
        return;
    }

    meshtastic_Routing routing = meshtastic_Routing_init_default;
    pb_istream_t rstream = pb_istream_from_buffer(decoded.payload.bytes, decoded.payload.size);
    if (!pb_decode(&rstream, meshtastic_Routing_fields, &routing))
    {
        return;
    }

    if (decoded.request_id != 0 && header.to == node_id_)
    {
        const meshtastic_Routing_Error reason =
            (routing.which_variant == meshtastic_Routing_error_reason_tag)
                ? routing.error_reason
                : meshtastic_Routing_Error_NONE;
        (void)stopPendingRetransmit(node_id_, decoded.request_id);
        (void)stopPendingRetransmit(header.from, decoded.request_id);
        emitRoutingResult(decoded.request_id, reason, header.from, header.to, channel, header.channel, &rx_meta);

        bool we_were_sole_relayer = false;
        const PacketHistoryEntry* hist = findHistory(node_id_, decoded.request_id);
        const bool ack_relayer_seen = hist && hasRelayer(*hist, header.relay_node);
        const bool we_were_relayer = hist && hasRelayer(*hist, ourRelayId(), &we_were_sole_relayer);
        if (reason == meshtastic_Routing_Error_NONE)
        {
            if ((we_were_relayer && ack_relayer_seen) ||
                (rx_meta.direct && we_were_sole_relayer) ||
                header.relay_node != 0)
            {
                learnNextHop(header.from, header.relay_node != 0 ? header.relay_node : static_cast<uint8_t>(header.from & 0xFFU));
            }
        }
        else if (reason == meshtastic_Routing_Error_GOT_NAK || reason == meshtastic_Routing_Error_NO_ROUTE)
        {
            if (contact_service_)
            {
                contact_service_->setNextHop(header.from, 0);
            }
        }

        if (reason == meshtastic_Routing_Error_PKI_UNKNOWN_PUBKEY ||
            reason == meshtastic_Routing_Error_NO_CHANNEL)
        {
            const auto cause = (reason == meshtastic_Routing_Error_PKI_UNKNOWN_PUBKEY)
                                   ? ::chat::runtime::MeshtasticPkiResyncCause::PeerReportsUnknownPubkey
                                   : ::chat::runtime::MeshtasticPkiResyncCause::PeerReportsNoChannel;
            (void)executePkiResync(cause, header.from, 0, channel);
        }
        return;
    }

    if ((decoded.request_id != 0 || decoded.reply_id != 0) && header.relay_node != 0)
    {
        learnNextHop(header.from, header.relay_node);
    }
}

void MeshtasticRadioAdapter::queuePendingRetransmit(const ::chat::meshtastic::PacketHeaderWire& header,
                                                    const uint8_t* wire, size_t wire_size,
                                                    ::chat::ChannelId channel,
                                                    bool local_origin, uint8_t retries_override,
                                                    bool observe_only)
{
    if (!wire || wire_size < sizeof(::chat::meshtastic::PacketHeaderWire) || header.id == 0)
    {
        return;
    }

    PendingRetransmitMeta pending{};
    pending.original_from = header.from;
    pending.dest = header.to;
    pending.packet_id = header.id;
    pending.channel = channel;
    pending.channel_hash = header.channel;
    pending.want_ack = (header.flags & ::chat::meshtastic::PACKET_FLAGS_WANT_ACK_MASK) != 0;
    pending.local_origin = local_origin;
    pending.observe_only = observe_only;
    if (observe_only)
    {
        pending.retries_left = 0;
        pending.next_tx_ms = millis() + kImplicitAckTimeoutMs;
    }
    else
    {
        pending.retries_left = retries_override != 0
                                   ? retries_override
                                   : (pending.want_ack ? kDefaultAckRetries : kDefaultNextHopRetries);
        pending.next_tx_ms = millis() + kRetransmitIntervalMs;
    }
    logMeshtasticRx("[gat562][mt] watch pending id=%08lX from=%08lX dest=%08lX observe=%u local=%u want_ack=%u next=%lu\n",
                    static_cast<unsigned long>(pending.packet_id),
                    static_cast<unsigned long>(pending.original_from),
                    static_cast<unsigned long>(pending.dest),
                    pending.observe_only ? 1U : 0U,
                    pending.local_origin ? 1U : 0U,
                    pending.want_ack ? 1U : 0U,
                    static_cast<unsigned long>(pending.next_tx_ms));

    const auto priority = pending.observe_only
                              ? ::chat::meshtastic::PendingWirePriority::P3
                              : ((pending.local_origin && pending.want_ack)
                                     ? ::chat::meshtastic::PendingWirePriority::P0
                                     : ::chat::meshtastic::PendingWirePriority::P1);
    ::chat::meshtastic::PendingWirePushReport report{};
    auto* slot = pending_retransmits_.upsert(pendingKey(header.from, header.id),
                                             priority,
                                             wire,
                                             wire_size,
                                             pending,
                                             &report);
    if (!slot)
    {
        logMeshtasticRx("[gat562][mt] pending drop new id=%08lX from=%08lX dest=%08lX priority=%u wire=%u max=%u depth=%u\n",
                        static_cast<unsigned long>(pending.packet_id),
                        static_cast<unsigned long>(pending.original_from),
                        static_cast<unsigned long>(pending.dest),
                        static_cast<unsigned>(priority),
                        static_cast<unsigned>(wire_size),
                        static_cast<unsigned>(pending_retransmits_.maxWireLen()),
                        static_cast<unsigned>(pending_retransmits_.size()));
        if (pending.local_origin && pending.want_ack)
        {
            emitRoutingResult(pending.packet_id,
                              meshtastic_Routing_Error_MAX_RETRANSMIT,
                              node_id_,
                              pending.dest,
                              pending.channel,
                              pending.channel_hash,
                              nullptr);
        }
        return;
    }

    if (report.result == ::chat::meshtastic::PendingWirePushReport::Result::DroppedExisting)
    {
        logMeshtasticRx("[gat562][mt] pending drop old key=%016llX priority=%u for id=%08lX priority=%u depth=%u\n",
                        static_cast<unsigned long long>(report.dropped_key),
                        static_cast<unsigned>(report.dropped_priority),
                        static_cast<unsigned long>(pending.packet_id),
                        static_cast<unsigned>(priority),
                        static_cast<unsigned>(pending_retransmits_.size()));
    }
}

bool MeshtasticRadioAdapter::stopPendingRetransmit(::chat::NodeId from, ::chat::MessageId packet_id)
{
    return pending_retransmits_.erase(pendingKey(from, packet_id));
}

