manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/chat/infra/meshtastic/meshtastic_radio_adapter.cpp
void MeshtasticRadioAdapter::maybeHandleObservedRelay(const ::chat::meshtastic::PacketHeaderWire& header)
{
    if (header.from == 0 || header.id == 0 || header.relay_node == 0)
    {
        return;
    }

    const PacketHistoryEntry* hist = findHistory(node_id_, header.id);
    if (!hist)
    {
        return;
    }

    if (hist->next_hop != 0 && hist->next_hop == header.relay_node)
    {
        learnNextHop(header.to, header.relay_node);
        (void)stopPendingRetransmit(node_id_, header.id);
    }
}

uint64_t MeshtasticRadioAdapter::pendingKey(::chat::NodeId from, ::chat::MessageId packet_id)
{
    return (static_cast<uint64_t>(from) << 32) | packet_id;
}

MeshtasticRadioAdapter::PkiNodeKeyEntry*
MeshtasticRadioAdapter::findPkiNodeKey(::chat::NodeId node_id)
{
    for (auto& entry : pki_node_keys_)
    {
        if (entry.used && entry.node_id == node_id)
        {
            return &entry;
        }
    }
    return nullptr;
}

const MeshtasticRadioAdapter::PkiNodeKeyEntry*
MeshtasticRadioAdapter::findPkiNodeKey(::chat::NodeId node_id) const
{
    for (const auto& entry : pki_node_keys_)
    {
        if (entry.used && entry.node_id == node_id)
        {
            return &entry;
        }
    }
    return nullptr;
}

MeshtasticRadioAdapter::PkiNodeKeyEntry*
MeshtasticRadioAdapter::upsertPkiNodeKey(::chat::NodeId node_id,
                                         const uint8_t* key,
                                         uint32_t last_seen_s,
                                         bool* out_changed,
                                         bool* out_evicted)
{
    if (out_changed)
    {
        *out_changed = false;
    }
    if (out_evicted)
    {
        *out_evicted = false;
    }
    if (node_id == 0 || !key)
    {
        return nullptr;
    }

    const uint32_t seen = last_seen_s != 0 ? last_seen_s : nowSeconds();
    if (auto* existing = findPkiNodeKey(node_id))
    {
        const bool changed = std::memcmp(existing->key.data(), key, existing->key.size()) != 0;
        if (changed)
        {
            std::memcpy(existing->key.data(), key, existing->key.size());
        }
        existing->last_seen_s = seen;
        if (out_changed)
        {
            *out_changed = changed;
        }
        return existing;
    }

    PkiNodeKeyEntry* slot = nullptr;
    for (auto& entry : pki_node_keys_)
    {
        if (!entry.used)
        {
            slot = &entry;
            break;
        }
    }
    if (!slot)
    {
        slot = &pki_node_keys_[0];
        for (auto& entry : pki_node_keys_)
        {
            if (entry.last_seen_s < slot->last_seen_s)
            {
                slot = &entry;
            }
        }
        if (out_evicted)
        {
            *out_evicted = true;
        }
    }

    *slot = PkiNodeKeyEntry{};
    slot->used = true;
    slot->node_id = node_id;
    slot->last_seen_s = seen;
    std::memcpy(slot->key.data(), key, slot->key.size());
    if (out_changed)
    {
        *out_changed = true;
    }
    return slot;
}

void MeshtasticRadioAdapter::clearPkiNodeKeys()
{
    for (auto& entry : pki_node_keys_)
    {
        entry = PkiNodeKeyEntry{};
    }
}

bool MeshtasticRadioAdapter::erasePkiNodeKey(::chat::NodeId node_id)
{
    if (auto* entry = findPkiNodeKey(node_id))
    {
        *entry = PkiNodeKeyEntry{};
        return true;
    }
    return false;
}

std::size_t MeshtasticRadioAdapter::pkiNodeKeyCount() const
{
    std::size_t count = 0;
    for (const auto& entry : pki_node_keys_)
    {
        if (entry.used)
        {
            ++count;
        }
    }
    return count;
}

MeshtasticRadioAdapter::NodeRuntimeEntry*
MeshtasticRadioAdapter::findNodeRuntime(::chat::NodeId node_id)
{
    for (auto& entry : node_runtime_)
    {
        if (entry.used && entry.node_id == node_id)
        {
            return &entry;
        }
    }
    return nullptr;
}

const MeshtasticRadioAdapter::NodeRuntimeEntry*
MeshtasticRadioAdapter::findNodeRuntime(::chat::NodeId node_id) const
{
    for (const auto& entry : node_runtime_)
    {
        if (entry.used && entry.node_id == node_id)
        {
            return &entry;
        }
    }
    return nullptr;
}

MeshtasticRadioAdapter::NodeRuntimeEntry*
MeshtasticRadioAdapter::upsertNodeRuntime(::chat::NodeId node_id, uint32_t now_ms)
{
    if (node_id == 0)
    {
        return nullptr;
    }
    if (auto* existing = findNodeRuntime(node_id))
    {
        existing->last_touch_ms = now_ms;
        return existing;
    }

    NodeRuntimeEntry* slot = nullptr;
    for (auto& entry : node_runtime_)
    {
        if (!entry.used)
        {
            slot = &entry;
            break;
        }
    }
    if (!slot)
    {
        slot = &node_runtime_[0];
        for (auto& entry : node_runtime_)
        {
            if (entry.last_touch_ms < slot->last_touch_ms)
            {
                slot = &entry;
            }
        }
    }

    *slot = NodeRuntimeEntry{};
    slot->used = true;
    slot->node_id = node_id;
    slot->last_touch_ms = now_ms;
    return slot;
}

void MeshtasticRadioAdapter::eraseNodeRuntime(::chat::NodeId node_id)
{
    if (auto* entry = findNodeRuntime(node_id))
    {
        *entry = NodeRuntimeEntry{};
    }
}

bool MeshtasticRadioAdapter::getNodeLastChannel(::chat::NodeId node_id,
                                                ::chat::ChannelId* out) const
{
    const auto* entry = findNodeRuntime(node_id);
    if (!entry || !entry->has_last_channel)
    {
        return false;
    }
    if (out)
    {
        *out = entry->last_channel;
    }
    return true;
}

void MeshtasticRadioAdapter::rememberNodeLastChannel(::chat::NodeId node_id,
                                                     ::chat::ChannelId channel,
                                                     uint32_t now_ms)
{
    if (auto* entry = upsertNodeRuntime(node_id, now_ms))
    {
        entry->last_channel = channel;
        entry->has_last_channel = true;
    }
}

uint32_t MeshtasticRadioAdapter::getNodeInfoReplyMs(::chat::NodeId node_id) const
{
    const auto* entry = findNodeRuntime(node_id);
    return entry ? entry->nodeinfo_reply_ms : 0;
}

