manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/chat/infra/meshtastic/meshtastic_radio_adapter.cpp
void MeshtasticRadioAdapter::setNodeInfoReplyMs(::chat::NodeId node_id, uint32_t now_ms)
{
    if (auto* entry = upsertNodeRuntime(node_id, now_ms))
    {
        entry->nodeinfo_reply_ms = now_ms;
    }
}

bool MeshtasticRadioAdapter::initPkiKeys()
{
    ::platform::nrf52::arduino_common::mesh::Nrf52SettingsLocalIdentityStore store;
    ::mesh::LocalIdentity stored_identity{};
    auto loaded = store.load(stored_identity);
    bool have_keys = loaded.ok &&
                     !isZeroKey(stored_identity.private_key,
                                sizeof(stored_identity.private_key));
    if (have_keys)
    {
        std::memcpy(pki_public_key_.data(), stored_identity.public_key, pki_public_key_.size());
        std::memcpy(pki_private_key_.data(), stored_identity.private_key, pki_private_key_.size());
    }

    if (!have_keys)
    {
        RNG.begin("trail-mate");
        auto mac = readMac();
        RNG.stir(mac.data(), mac.size());
        uint32_t noise = random();
        RNG.stir(reinterpret_cast<const uint8_t*>(&noise), sizeof(noise));
        Curve25519::dh1(pki_public_key_.data(), pki_private_key_.data());
        have_keys = !isZeroKey(pki_private_key_.data(), pki_private_key_.size());
        if (have_keys)
        {
            ::mesh::LocalIdentity generated{};
            std::memcpy(generated.public_key, pki_public_key_.data(), sizeof(generated.public_key));
            std::memcpy(generated.private_key, pki_private_key_.data(), sizeof(generated.private_key));
            generated.valid = true;
            (void)store.save(generated);
        }
    }

    return have_keys;
}

void MeshtasticRadioAdapter::loadPkiNodeKeys()
{
    ::platform::nrf52::arduino_common::mesh::Nrf52SettingsPeerKeyStore store;
    size_t key_count = 0;
    auto loaded = store.loadAll(pki_save_entries_.data(),
                                pki_save_entries_.size(),
                                &key_count);
    if (!loaded.ok)
    {
        if (loaded.failure != ::mesh::StoreFailure::NotFound)
        {
            logMeshtasticRx("[gat562][mt] pki key load failed status=%u\n",
                            static_cast<unsigned>(loaded.failure));
        }
        return;
    }

    clearPkiNodeKeys();
    for (size_t index = 0; index < key_count; ++index)
    {
        const auto& peer_key = pki_save_entries_[index];
        bool evicted = false;
        (void)upsertPkiNodeKey(peer_key.node_id.value,
                               peer_key.public_key,
                               peer_key.updated_at_ms,
                               nullptr,
                               &evicted);
        if (evicted)
        {
            logMeshtasticRx("[gat562][mt] pki key load evicted oldest node=%08lX cap=%u\n",
                            static_cast<unsigned long>(peer_key.node_id.value),
                            static_cast<unsigned>(pki_node_keys_.size()));
        }
    }
}

void MeshtasticRadioAdapter::savePkiNodeKey(::chat::NodeId node_id,
                                            const uint8_t* key,
                                            size_t key_len)
{
    if (node_id == 0)
    {
        return;
    }

    if (!key || key_len != 32)
    {
        logMeshtasticRx("[gat562][mt] ignore invalid pki key node=%08lX len=%u\n",
                        static_cast<unsigned long>(node_id),
                        static_cast<unsigned>(key_len));
        return;
    }

    bool changed = false;
    bool evicted = false;
    if (!upsertPkiNodeKey(node_id, key, nowSeconds(), &changed, &evicted))
    {
        return;
    }

    if (changed || evicted)
    {
        markPkiKeysDirty();

        logMeshtasticRx("[gat562][mt] pki key updated node=%08lX evicted=%u depth=%u\n",
                        static_cast<unsigned long>(node_id),
                        evicted ? 1U : 0U,
                        static_cast<unsigned>(pkiNodeKeyCount()));
    }

    // Refresh recency even when the key bytes did not change.
    touchPkiNodeKey(node_id);
}

void MeshtasticRadioAdapter::markPkiKeysDirty()
{
    pki_node_keys_dirty_ = true;
    pki_node_keys_save_due_ms_ = millis() + kPkiNodeSaveDebounceMs;
}

void MeshtasticRadioAdapter::forgetNodePublicKey(::chat::NodeId node_id)
{
    if (node_id == 0)
    {
        return;
    }

    (void)erasePkiNodeKey(node_id);
    eraseNodeRuntime(node_id);
    markPkiKeysDirty();
}

bool MeshtasticRadioAdapter::savePkiKeysToPrefs()
{
    size_t count = 0;
    for (const auto& item : pki_node_keys_)
    {
        if (!item.used)
        {
            continue;
        }
        if (count >= pki_save_entries_.size())
        {
            break;
        }
        ::mesh::PeerPublicKey entry{};
        entry.node_id = ::mesh::NodeId{item.node_id};
        entry.updated_at_ms = item.last_seen_s;
        entry.verified = false;
        std::memcpy(entry.public_key, item.key.data(), sizeof(entry.public_key));
        pki_save_entries_[count++] = entry;
    }

    ::platform::nrf52::arduino_common::mesh::Nrf52SettingsPeerKeyStore store;
    auto saved = store.replaceAll(count == 0 ? nullptr : pki_save_entries_.data(), count);
    if (saved.ok)
    {
        pki_node_keys_dirty_ = false;
    }
    return saved.ok;
}

void MeshtasticRadioAdapter::touchPkiNodeKey(::chat::NodeId node_id)
{
    if (auto* entry = findPkiNodeKey(node_id))
    {
        entry->last_seen_s = nowSeconds();
    }
}

bool MeshtasticRadioAdapter::decryptPkiPayload(::chat::NodeId from, ::chat::MessageId packet_id,
                                               const uint8_t* cipher, size_t cipher_len,
                                               uint8_t* out_plain, size_t* out_plain_len)
{
    if (!cipher || cipher_len <= 12 || !out_plain || !out_plain_len || !pki_ready_)
    {
        return false;
    }

    auto* key_entry = findPkiNodeKey(from);
    if (!key_entry)
    {
        (void)executePkiResync(::chat::runtime::MeshtasticPkiResyncCause::PeerKeyMissing,
                               from,
                               packet_id,
                               ::chat::ChannelId::PRIMARY);
        return false;
    }

    touchPkiNodeKey(from);
    uint8_t shared[32] = {};
    uint8_t local_priv[32] = {};
    std::memcpy(shared, key_entry->key.data(), sizeof(shared));
    std::memcpy(local_priv, pki_private_key_.data(), sizeof(local_priv));
    if (!Curve25519::dh2(shared, local_priv))
    {
        (void)executePkiResync(::chat::runtime::MeshtasticPkiResyncCause::PeerKeyStale,
                               from,
                               packet_id,
                               ::chat::ChannelId::PRIMARY);
        return false;
    }
    hashSharedKey(shared, sizeof(shared));

    const uint8_t* auth = cipher + (cipher_len - 12);
    uint32_t extra_nonce = 0;
    std::memcpy(&extra_nonce, auth + 8, sizeof(extra_nonce));

    uint8_t nonce[::chat::meshtastic::kPkiNonceSize] = {};
    initPkiNonce(from, static_cast<uint64_t>(packet_id), extra_nonce, nonce);

    const size_t plain_len = cipher_len - 12;
    if (*out_plain_len < plain_len)
    {
        *out_plain_len = plain_len;
        return false;
    }
    if (!::chat::meshtastic::decryptPkiAesCcm(shared, sizeof(shared), nonce, 8,
                                              cipher, plain_len, nullptr, 0, auth, out_plain))
    {
        (void)executePkiResync(::chat::runtime::MeshtasticPkiResyncCause::PeerKeyStale,
                               from,
                               packet_id,
                               ::chat::ChannelId::PRIMARY);
        return false;
    }

