manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/chat/infra/meshtastic/meshtastic_radio_adapter.cpp
    *out_plain_len = plain_len;
    return true;
}

bool MeshtasticRadioAdapter::encryptPkiPayload(::chat::NodeId dest, ::chat::MessageId packet_id,
                                               const uint8_t* plain, size_t plain_len,
                                               uint8_t* out_cipher, size_t* out_cipher_len)
{
    if (!plain || !out_cipher || !out_cipher_len || !pki_ready_)
    {
        return false;
    }

    auto* key_entry = findPkiNodeKey(dest);
    if (!key_entry)
    {
        return false;
    }

    touchPkiNodeKey(dest);
    uint8_t shared[32] = {};
    uint8_t local_priv[32] = {};
    std::memcpy(shared, key_entry->key.data(), sizeof(shared));
    std::memcpy(local_priv, pki_private_key_.data(), sizeof(local_priv));
    if (!Curve25519::dh2(shared, local_priv))
    {
        return false;
    }
    hashSharedKey(shared, sizeof(shared));

    const uint32_t extra_nonce = static_cast<uint32_t>(random());
    uint8_t nonce[::chat::meshtastic::kPkiNonceSize] = {};
    initPkiNonce(node_id_, static_cast<uint64_t>(packet_id), extra_nonce, nonce);

    const size_t needed = plain_len + 8 + sizeof(extra_nonce);
    if (*out_cipher_len < needed)
    {
        *out_cipher_len = needed;
        return false;
    }

    uint8_t auth[16] = {};
    if (!::chat::meshtastic::encryptPkiAesCcm(shared, sizeof(shared), nonce, 8,
                                              nullptr, 0,
                                              plain, plain_len,
                                              out_cipher, auth))
    {
        return false;
    }

    std::memcpy(out_cipher + plain_len, auth, 8);
    std::memcpy(out_cipher + plain_len + 8, &extra_nonce, sizeof(extra_nonce));
    *out_cipher_len = needed;
    return true;
}

void MeshtasticRadioAdapter::updateKeyVerificationState()
{
    if (kv_state_ == KeyVerificationState::Idle)
    {
        return;
    }
    const uint32_t now_ms = millis();
    if (kv_nonce_ms_ != 0 && (now_ms - kv_nonce_ms_) > kKeyVerificationTimeoutMs)
    {
        resetKeyVerificationState();
        return;
    }
    kv_nonce_ms_ = now_ms;
}

void MeshtasticRadioAdapter::resetKeyVerificationState()
{
    kv_state_ = KeyVerificationState::Idle;
    kv_nonce_ = 0;
    kv_nonce_ms_ = 0;
    kv_security_number_ = 0;
    kv_remote_node_ = 0;
    kv_hash1_.fill(0);
    kv_hash2_.fill(0);
}

void MeshtasticRadioAdapter::buildVerificationCode(char* out, size_t out_len) const
{
    if (!out || out_len < 10)
    {
        if (out && out_len > 0)
        {
            out[0] = '\0';
        }
        return;
    }
    for (int i = 0; i < 4; ++i)
    {
        out[i] = static_cast<char>((kv_hash1_[i] >> 2) + '0');
        out[i + 5] = static_cast<char>((kv_hash1_[i + 4] >> 2) + '0');
    }
    out[4] = ' ';
    out[9] = '\0';
}

bool MeshtasticRadioAdapter::handleKeyVerificationInit(const ::chat::meshtastic::PacketHeaderWire& header,
                                                       const meshtastic_KeyVerification& kv)
{
    updateKeyVerificationState();
    if (kv_state_ != KeyVerificationState::Idle || header.to != node_id_ || header.to == kBroadcastNode || !pki_ready_)
    {
        return false;
    }
    auto* key_entry = findPkiNodeKey(header.from);
    if (!key_entry)
    {
        return false;
    }

    kv_nonce_ = kv.nonce;
    kv_nonce_ms_ = millis();
    kv_remote_node_ = header.from;
    kv_security_number_ = static_cast<uint32_t>(random(1, 1000000));
    if (!computeKeyVerificationHashes(kv_security_number_,
                                      kv_nonce_,
                                      kv_remote_node_,
                                      node_id_,
                                      key_entry->key.data(),
                                      key_entry->key.size(),
                                      pki_public_key_.data(),
                                      pki_public_key_.size(),
                                      kv_hash1_.data(),
                                      kv_hash2_.data()))
    {
        resetKeyVerificationState();
        return false;
    }

    meshtastic_KeyVerification reply = meshtastic_KeyVerification_init_zero;
    reply.nonce = kv_nonce_;
    reply.hash2.size = static_cast<pb_size_t>(kv_hash2_.size());
    std::memcpy(reply.hash2.bytes, kv_hash2_.data(), kv_hash2_.size());
    if (!sendKeyVerificationPacket(kv_remote_node_, reply, false))
    {
        resetKeyVerificationState();
        return false;
    }

    kv_state_ = KeyVerificationState::ReceiverAwaitingHash1;
    sys::EventBus::publish(new sys::KeyVerificationNumberInformEvent(kv_remote_node_, kv_nonce_, kv_security_number_), 0);
    return true;
}

bool MeshtasticRadioAdapter::handleKeyVerificationReply(const ::chat::meshtastic::PacketHeaderWire& header,
                                                        const meshtastic_KeyVerification& kv)
{
    updateKeyVerificationState();
    if (kv_state_ != KeyVerificationState::SenderInitiated ||
        header.to != node_id_ || header.to == kBroadcastNode ||
        kv.nonce != kv_nonce_ || header.from != kv_remote_node_ ||
        kv.hash1.size != 0 || kv.hash2.size != 32)
    {
        return false;
    }

    std::memcpy(kv_hash2_.data(), kv.hash2.bytes, kv_hash2_.size());
    kv_state_ = KeyVerificationState::SenderAwaitingNumber;
    kv_nonce_ms_ = millis();
    sys::EventBus::publish(new sys::KeyVerificationNumberRequestEvent(kv_remote_node_, kv_nonce_), 0);
    return true;
}

bool MeshtasticRadioAdapter::processKeyVerificationNumber(::chat::NodeId remote_node, uint64_t nonce, uint32_t number)
{
    updateKeyVerificationState();
    if (kv_state_ != KeyVerificationState::SenderAwaitingNumber ||
        kv_remote_node_ != remote_node || kv_nonce_ != nonce)
    {
        return false;
    }

    auto* key_entry = findPkiNodeKey(remote_node);
    if (!key_entry)
    {
        resetKeyVerificationState();
        return false;
    }

    std::array<uint8_t, 32> scratch_hash{};
    kv_security_number_ = number;
    if (!computeKeyVerificationHashes(kv_security_number_,
                                      kv_nonce_,
                                      node_id_,
                                      kv_remote_node_,
                                      pki_public_key_.data(),
                                      pki_public_key_.size(),
                                      key_entry->key.data(),
                                      key_entry->key.size(),
                                      kv_hash1_.data(),
                                      scratch_hash.data()))
    {
        return false;
    }
    if (std::memcmp(scratch_hash.data(), kv_hash2_.data(), kv_hash2_.size()) != 0)
    {
        return false;
    }

