manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/chat/infra/meshtastic/meshtastic_radio_adapter.cpp
    meshtastic_KeyVerification response = meshtastic_KeyVerification_init_zero;
    response.nonce = kv_nonce_;
    response.hash1.size = static_cast<pb_size_t>(kv_hash1_.size());
    std::memcpy(response.hash1.bytes, kv_hash1_.data(), kv_hash1_.size());
    if (!sendKeyVerificationPacket(kv_remote_node_, response, true))
    {
        return false;
    }

    kv_state_ = KeyVerificationState::SenderAwaitingUser;
    kv_nonce_ms_ = millis();
    char code[12] = {};
    buildVerificationCode(code, sizeof(code));
    sys::EventBus::publish(new sys::KeyVerificationFinalEvent(kv_remote_node_, kv_nonce_, true, code), 0);
    return true;
}

bool MeshtasticRadioAdapter::handleKeyVerificationFinal(const ::chat::meshtastic::PacketHeaderWire& header,
                                                        const meshtastic_KeyVerification& kv)
{
    updateKeyVerificationState();
    if (kv_state_ != KeyVerificationState::ReceiverAwaitingHash1 ||
        header.to != node_id_ || header.to == kBroadcastNode ||
        kv.nonce != kv_nonce_ || header.from != kv_remote_node_ ||
        kv.hash1.size != 32 || kv.hash2.size != 0)
    {
        return false;
    }
    if (std::memcmp(kv.hash1.bytes, kv_hash1_.data(), kv_hash1_.size()) != 0)
    {
        return false;
    }

    kv_state_ = KeyVerificationState::ReceiverAwaitingUser;
    kv_nonce_ms_ = millis();
    char code[12] = {};
    buildVerificationCode(code, sizeof(code));
    sys::EventBus::publish(new sys::KeyVerificationFinalEvent(kv_remote_node_, kv_nonce_, false, code), 0);
    return true;
}

bool MeshtasticRadioAdapter::sendKeyVerificationPacket(::chat::NodeId dest, const meshtastic_KeyVerification& kv,
                                                       bool want_response)
{
    if (!pki_ready_ || !hasPkiKey(dest))
    {
        return false;
    }

    uint8_t kv_buf[96] = {};
    pb_ostream_t kv_stream = pb_ostream_from_buffer(kv_buf, sizeof(kv_buf));
    if (!pb_encode(&kv_stream, meshtastic_KeyVerification_fields, &kv))
    {
        return false;
    }

    auto& scratch = tx_scratch_;
    std::fill(scratch.app_data.begin(), scratch.app_data.end(), 0);
    std::fill(scratch.aux_data.begin(), scratch.aux_data.end(), 0);
    std::fill(scratch.wire.begin(), scratch.wire.end(), 0);

    uint8_t* data_buf = scratch.app_data.data();
    size_t data_size = scratch.app_data.size();
    if (!::chat::meshtastic::encodeAppData(meshtastic_PortNum_KEY_VERIFICATION_APP,
                                           kv_buf,
                                           kv_stream.bytes_written,
                                           want_response,
                                           data_buf,
                                           &data_size))
    {
        return false;
    }

    uint8_t* pki_buf = scratch.aux_data.data();
    size_t pki_len = scratch.aux_data.size();
    const ::chat::MessageId packet_id = next_packet_id_++;
    if (!encryptPkiPayload(dest, packet_id, data_buf, data_size, pki_buf, &pki_len))
    {
        return false;
    }

    uint8_t* wire = scratch.wire.data();
    size_t wire_size = scratch.wire.size();
    if (!::chat::meshtastic::buildWirePacket(pki_buf, pki_len,
                                             node_id_, packet_id,
                                             dest, 0, config_.hop_limit, false,
                                             nullptr, 0, wire, &wire_size))
    {
        return false;
    }

    return transmitPreparedWire(wire, wire_size, ::chat::ChannelId::PRIMARY, nullptr, false, true);
}

std::string MeshtasticRadioAdapter::mqttNodeIdString() const
{
    char node_id[16];
    snprintf(node_id, sizeof(node_id), "!%08lx", static_cast<unsigned long>(node_id_));
    return std::string(node_id);
}

const char* MeshtasticRadioAdapter::mqttChannelIdFor(::chat::ChannelId channel) const
{
    return ::chat::meshtastic::mqttChannelIdFor(mqtt_proxy_settings_, channel);
}

bool MeshtasticRadioAdapter::hasAnyMqttDownlinkEnabled() const
{
    return ::chat::meshtastic::hasAnyMqttDownlinkEnabled(mqtt_proxy_settings_);
}

bool MeshtasticRadioAdapter::shouldPublishToMqtt(::chat::ChannelId channel, bool from_mqtt, bool is_pki) const
{
    return ::chat::meshtastic::shouldPublishToMqtt(
        mqtt_proxy_settings_, channel, from_mqtt, is_pki);
}

uint8_t MeshtasticRadioAdapter::mqttChannelHashForId(const char* channel_id, bool* out_known,
                                                     ::chat::ChannelId* out_channel) const
{
    const auto match =
        ::chat::meshtastic::resolveMqttProxyDownlinkChannel(mqtt_proxy_settings_, channel_id);
    bool known = match.known;
    ::chat::ChannelId channel = match.channel;
    size_t key_len = 0;
    const uint8_t* key = nullptr;
    uint8_t hash = 0;

    if (match.pki)
    {
        hash = 0;
    }
    else if (match.known && match.channel == ::chat::ChannelId::PRIMARY)
    {
        key = selectKey(config_, ::chat::ChannelId::PRIMARY, &key_len);
        hash = ::chat::meshtastic::computeChannelHash(
            channelNameFor(config_, ::chat::ChannelId::PRIMARY),
            key,
            key_len);
    }
    else if (match.known && match.channel == ::chat::ChannelId::SECONDARY)
    {
        key = selectKey(config_, ::chat::ChannelId::SECONDARY, &key_len);
        hash = ::chat::meshtastic::computeChannelHash(
            channelNameFor(config_, ::chat::ChannelId::SECONDARY),
            key,
            key_len);
    }

    if (out_known)
    {
        *out_known = known;
    }
    if (out_channel)
    {
        *out_channel = channel;
    }
    return hash;
}

bool MeshtasticRadioAdapter::decodeMqttServiceEnvelope(const uint8_t* payload, size_t payload_len,
                                                       meshtastic_MeshPacket* out_packet,
                                                       char* out_channel_id, size_t channel_id_len,
                                                       char* out_gateway_id, size_t gateway_id_len) const
{
    if (!payload || payload_len == 0 || !out_packet || !out_channel_id || !out_gateway_id ||
        channel_id_len == 0 || gateway_id_len == 0)
    {
        return false;
    }

    *out_packet = meshtastic_MeshPacket_init_zero;
    out_channel_id[0] = '\0';
    out_gateway_id[0] = '\0';

