manmuqingshan/trail-mate/platform/nrf52/arduino_common/src/chat/infra/meshtastic/meshtastic_radio_adapter.cpp
    pb_istream_t stream = pb_istream_from_buffer(payload, payload_len);
    while (stream.bytes_left > 0)
    {
        pb_wire_type_t wire_type = PB_WT_VARINT;
        uint32_t tag = 0;
        bool eof = false;
        if (!pb_decode_tag(&stream, &wire_type, &tag, &eof))
        {
            return false;
        }
        if (eof)
        {
            break;
        }

        if (tag == meshtastic_ServiceEnvelope_packet_tag)
        {
            if (wire_type != PB_WT_STRING)
            {
                return false;
            }
            pb_istream_t substream;
            if (!pb_make_string_substream(&stream, &substream))
            {
                return false;
            }
            bool ok = pb_decode(&substream, meshtastic_MeshPacket_fields, out_packet);
            pb_close_string_substream(&stream, &substream);
            if (!ok)
            {
                return false;
            }
        }
        else if (tag == meshtastic_ServiceEnvelope_channel_id_tag)
        {
            if (wire_type != PB_WT_STRING)
            {
                return false;
            }
            pb_istream_t substream;
            if (!pb_make_string_substream(&stream, &substream))
            {
                return false;
            }
            bool ok = readPbString(&substream, out_channel_id, channel_id_len);
            pb_close_string_substream(&stream, &substream);
            if (!ok)
            {
                return false;
            }
        }
        else if (tag == meshtastic_ServiceEnvelope_gateway_id_tag)
        {
            if (wire_type != PB_WT_STRING)
            {
                return false;
            }
            pb_istream_t substream;
            if (!pb_make_string_substream(&stream, &substream))
            {
                return false;
            }
            bool ok = readPbString(&substream, out_gateway_id, gateway_id_len);
            pb_close_string_substream(&stream, &substream);
            if (!ok)
            {
                return false;
            }
        }
        else if (!pb_skip_field(&stream, wire_type))
        {
            return false;
        }
    }

    return out_packet->which_payload_variant == meshtastic_MeshPacket_decoded_tag ||
           out_packet->which_payload_variant == meshtastic_MeshPacket_encrypted_tag;
}

bool MeshtasticRadioAdapter::enqueueMqttEnvelope(const meshtastic_MeshPacket& packet,
                                                 const char* channel_id,
                                                 const char* gateway_id)
{
    if (!channel_id || *channel_id == '\0')
    {
        return false;
    }

    PendingMqttDownlink pending{};
    pending.packet = packet;
    std::strncpy(pending.channel_id, channel_id, sizeof(pending.channel_id) - 1U);
    pending.channel_id[sizeof(pending.channel_id) - 1U] = '\0';
    if (gateway_id)
    {
        std::strncpy(pending.gateway_id, gateway_id, sizeof(pending.gateway_id) - 1U);
        pending.gateway_id[sizeof(pending.gateway_id) - 1U] = '\0';
    }

    bool dropped = false;
    pending_mqtt_downlinks_.pushDropOldest(pending, &dropped);
    logMeshtasticRx("[nrf52][mt][mqtt] downlink queued topic_ch='%s' gateway='%s' from=%08lX to=%08lX id=%08lX q=%u dropped=%u\n",
                    pending.channel_id,
                    pending.gateway_id,
                    static_cast<unsigned long>(packet.from),
                    static_cast<unsigned long>(packet.to),
                    static_cast<unsigned long>(packet.id),
                    static_cast<unsigned>(pending_mqtt_downlinks_.size()),
                    dropped ? 1U : 0U);
    return true;
}

void MeshtasticRadioAdapter::processPendingMqttDownlinks()
{
    for (std::size_t count = 0; count < kPendingMqttDownlinkDrainPerTick; ++count)
    {
        PendingMqttDownlink pending{};
        if (!pending_mqtt_downlinks_.popOldest(&pending))
        {
            return;
        }

        (void)injectMqttEnvelope(pending.packet, pending.channel_id, pending.gateway_id);
    }
}

bool MeshtasticRadioAdapter::injectMqttEnvelope(const meshtastic_MeshPacket& packet,
                                                const char* channel_id,
                                                const char* gateway_id)
{
    if (!::chat::meshtastic::mqttProxyRuntimeEnabled(mqtt_proxy_settings_))
    {
        logMeshtasticRx("[nrf52][mt][mqtt] downlink reject reason=%s enabled=%u proxy=%u\n",
                        ::chat::meshtastic::mqttProxyRejectReasonName(
                            ::chat::meshtastic::MqttProxyRejectReason::ProxyDisabled),
                        mqtt_proxy_settings_.enabled ? 1U : 0U,
                        mqtt_proxy_settings_.proxy_to_client_enabled ? 1U : 0U);
        return false;
    }

    bool known_channel = false;
    ::chat::ChannelId channel_index = ::chat::ChannelId::PRIMARY;
    const uint8_t channel_hash = mqttChannelHashForId(channel_id, &known_channel, &channel_index);
    const auto channel_reason = ::chat::meshtastic::validateMqttDownlinkChannel(known_channel);
    if (channel_reason != ::chat::meshtastic::MqttProxyRejectReason::None)
    {
        logMeshtasticRx("[nrf52][mt][mqtt] downlink reject reason=%s channel='%s' primary='%s' p_down=%u secondary='%s' s_down=%u\n",
                        ::chat::meshtastic::mqttProxyRejectReasonName(channel_reason),
                        channel_id ? channel_id : "",
                        mqtt_proxy_settings_.primary_channel_id.c_str(),
                        mqtt_proxy_settings_.primary_downlink_enabled ? 1U : 0U,
                        mqtt_proxy_settings_.secondary_channel_id.c_str(),
                        mqtt_proxy_settings_.secondary_downlink_enabled ? 1U : 0U);
        return false;
    }

    const auto accept_policy = ::chat::runtime::resolveMeshtasticMqttDownlinkPolicy(
        gateway_id,
        node_id_,
        packet.from,
        packet.to,
        config_.tx_enabled);
    if (!accept_policy.accept_locally)
    {
        logMeshtasticRx("[nrf52][mt][mqtt] downlink ignore reason=%s gateway='%s' from=%08lX id=%08lX\n",
                        ::chat::runtime::meshtasticMqttDownlinkReasonName(accept_policy.reason),
                        gateway_id ? gateway_id : "",
                        static_cast<unsigned long>(packet.from),
                        static_cast<unsigned long>(packet.id));
        return false;
    }

    const bool is_decoded_payload = packet.which_payload_variant == meshtastic_MeshPacket_decoded_tag;
    const meshtastic_PortNum decoded_portnum =
        is_decoded_payload ? packet.decoded.portnum : meshtastic_PortNum_UNKNOWN_APP;
    const bool is_metadata_only_payload =
        is_decoded_payload &&
        ::chat::meshtastic::isMqttMetadataOnlyDownlinkPort(decoded_portnum);
    const auto decoded_reason = ::chat::meshtastic::validateMqttDecodedDownlinkPayload(
        mqtt_proxy_settings_, is_decoded_payload, decoded_portnum);
    if (decoded_reason != ::chat::meshtastic::MqttProxyRejectReason::None)
    {
        logMeshtasticRx("[nrf52][mt][mqtt] downlink reject reason=%s port=%u enc=%u\n",
                        ::chat::meshtastic::mqttProxyRejectReasonName(decoded_reason),
                        is_decoded_payload ? static_cast<unsigned>(decoded_portnum) : 0U,
                        mqtt_proxy_settings_.encryption_enabled ? 1U : 0U);
        return false;
    }

    auto& scratch = mqtt_downlink_scratch_;
    std::fill(scratch.wire.begin(), scratch.wire.end(), 0);
    uint8_t* wire_buffer = scratch.wire.data();
    size_t wire_size = sizeof(::chat::meshtastic::PacketHeaderWire);

    if (packet.which_payload_variant == meshtastic_MeshPacket_encrypted_tag)
    {
        ::chat::meshtastic::PacketHeaderWire header{};
        header.to = packet.to;
        header.from = packet.from;
        header.id = packet.id;
        header.flags = (packet.hop_limit & ::chat::meshtastic::PACKET_FLAGS_HOP_LIMIT_MASK) |
                       ((packet.hop_start << ::chat::meshtastic::PACKET_FLAGS_HOP_START_SHIFT) &
                        ::chat::meshtastic::PACKET_FLAGS_HOP_START_MASK) |
                       ::chat::meshtastic::PACKET_FLAGS_VIA_MQTT_MASK;
        if (packet.want_ack)
        {
            header.flags |= ::chat::meshtastic::PACKET_FLAGS_WANT_ACK_MASK;
        }
        header.channel = packet.channel != 0 ? packet.channel : channel_hash;
        header.next_hop = packet.next_hop;
        header.relay_node = packet.relay_node;
        std::memcpy(wire_buffer, &header, sizeof(header));

        const size_t enc_size =
            std::min(static_cast<size_t>(packet.encrypted.size), sizeof(packet.encrypted.bytes));
        if (wire_size + enc_size > scratch.wire.size())
        {
            logMeshtasticRx("[nrf52][mt][mqtt] downlink reject reason=%s encrypted=%u wire_cap=%u\n",
                            ::chat::meshtastic::mqttProxyRejectReasonName(
                                ::chat::meshtastic::MqttProxyRejectReason::PayloadTooLarge),
                            static_cast<unsigned>(enc_size),
                            static_cast<unsigned>(scratch.wire.size()));
            return false;
        }
        std::memcpy(wire_buffer + wire_size, packet.encrypted.bytes, enc_size);
        wire_size += enc_size;
    }
    else
    {
        std::memset(&scratch.decoded, 0, sizeof(scratch.decoded));
        scratch.decoded = packet.decoded;
        meshtastic_Data& decoded = scratch.decoded;
        decoded.dest = packet.to;
        decoded.source = packet.from;
        decoded.has_bitfield = true;

        std::fill(scratch.buffer.begin(), scratch.buffer.end(), 0);
        pb_ostream_t dstream = pb_ostream_from_buffer(scratch.buffer.data(), scratch.buffer.size());
        if (!pb_encode(&dstream, meshtastic_Data_fields, &decoded))
        {
            logMeshtasticRx("[nrf52][mt][mqtt] downlink reject reason=%s port=%u\n",
                            ::chat::meshtastic::mqttProxyRejectReasonName(
                                ::chat::meshtastic::MqttProxyRejectReason::DataEncodeFailed),
                            static_cast<unsigned>(decoded.portnum));
            return false;
        }

        size_t psk_len = 0;
        const uint8_t* psk = selectKey(config_, channel_index, &psk_len);
        size_t rebuilt_size = scratch.wire.size();
        if (!::chat::meshtastic::buildWirePacket(scratch.buffer.data(), dstream.bytes_written,
                                                 packet.from, packet.id,
                                                 packet.to, channel_hash, packet.hop_limit, packet.want_ack,
                                                 psk, psk_len, wire_buffer, &rebuilt_size))
        {
            logMeshtasticRx("[nrf52][mt][mqtt] downlink reject reason=%s id=%08lX ch=0x%02X data=%u\n",
                            ::chat::meshtastic::mqttProxyRejectReasonName(
                                ::chat::meshtastic::MqttProxyRejectReason::WireBuildFailed),
                            static_cast<unsigned long>(packet.id),
                            static_cast<unsigned>(channel_hash),
                            static_cast<unsigned>(dstream.bytes_written));
            return false;
        }
        wire_size = rebuilt_size;
        auto* rebuilt_header = reinterpret_cast<::chat::meshtastic::PacketHeaderWire*>(wire_buffer);
        rebuilt_header->flags |= ::chat::meshtastic::PACKET_FLAGS_VIA_MQTT_MASK;
        if (packet.hop_start != 0)
        {
            rebuilt_header->flags &= ~::chat::meshtastic::PACKET_FLAGS_HOP_START_MASK;
            rebuilt_header->flags |= ((packet.hop_start << ::chat::meshtastic::PACKET_FLAGS_HOP_START_SHIFT) &
                                      ::chat::meshtastic::PACKET_FLAGS_HOP_START_MASK);
        }
        rebuilt_header->next_hop = packet.next_hop;
        rebuilt_header->relay_node = packet.relay_node;
    }

    auto* tx_header = reinterpret_cast<::chat::meshtastic::PacketHeaderWire*>(wire_buffer);
    logMeshtasticRx("[nrf52][mt][mqtt] downlink inject topic_ch='%s' gateway='%s' from=%08lX to=%08lX id=%08lX\n",
                    channel_id ? channel_id : "",
                    gateway_id ? gateway_id : "",
                    static_cast<unsigned long>(tx_header->from),
                    static_cast<unsigned long>(tx_header->to),
                    static_cast<unsigned long>(tx_header->id));
    if (is_metadata_only_payload)
    {
        logMeshtasticRx("[nrf52][mt][mqtt] downlink mesh tx skipped reason=metadata_only port=%u id=%08lX\n",
                        static_cast<unsigned>(decoded_portnum),
                        static_cast<unsigned long>(tx_header->id));
    }
    else
    {
        const auto tx_policy = ::chat::runtime::resolveMeshtasticMqttDownlinkPolicy(
            gateway_id,
            node_id_,
            tx_header->from,
            tx_header->to,
            config_.tx_enabled);
        if (!tx_policy.transmit_to_mesh)
        {
            logMeshtasticRx("[nrf52][mt][mqtt] downlink mesh tx skipped reason=%s id=%08lX\n",
                            ::chat::runtime::meshtasticMqttDownlinkReasonName(tx_policy.reason),
                            static_cast<unsigned long>(tx_header->id));
        }
        else
        {
            const bool tx_ok = transmitWire(wire_buffer, wire_size);
            logMeshtasticRx("[nrf52][mt][mqtt] downlink mesh tx id=%08lX ch=0x%02X len=%u ok=%u\n",
                            static_cast<unsigned long>(tx_header->id),
                            static_cast<unsigned>(tx_header->channel),
                            static_cast<unsigned>(wire_size),
                            tx_ok ? 1U : 0U);
        }
    }

